[

    {
        "Title": "Basic Principles of Domestic Psychology and Bringing Philosophy To Children by M",
        "Price": "$75.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Set of 2 Books The Mountain is You + The Psychology of Money English Paperback",
        "Price": "$18.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "4 Book Set Rich Dad Poor Dad, The Psychology of Money, Atomic Habits+ Ikigai PB",
        "Price": "$27.49",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Psychology of Money Deep work Atomic Habits Paperback 3 book set",
        "Price": "$21.47",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Psychology of Money : Timeless Lessons on Wealth, Greed, and Happiness by...",
        "Price": "$9.58",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Heavily informative. Currently still reading, it's slightly entertaining with some anecdotes but rather focused upon details. Still have yet to fully finish but it's life changin!",
            "Great book and easy to read and put down temporarily.",
            "This is a must read if you want to learn and control your money",
            "The book came in like new condition.  The content is compelling and entertaining.  I recommend it.",
            "Great insight into how people behave with their money"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Psychology of Money By Morgan Housel Timeless Lessons on Wealth, Greed...",
        "Price": "$9.60",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Doesn’t matter where we are on in our money game… we can always invest, so we can start by deciding or choosing to Today!",
            "The content is very compelling. It's a shame parts of it are almost unreadable for lack of proofreading.",
            "Great book - highlighted. probably 1/4 of it.  read it.",
            "Good insight into personnel finance on managing money",
            "A great book that everyone should read."
        ],
        "Rating": "5"
    },
    {
        "Title": "Cant Hurt Me: Master Your Mind Defy the Odds by David Goggins, Paperback",
        "Price": "$10.87",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Mindset: The New Psychology of Success - Paperback By Dweck, Carol S. - GOOD",
        "Price": "$4.08",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Mindset: The New Psychology of Success - Paperback By Dweck, Carol S. - GOOD",
        "Price": "$4.08",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Flow: The Psychology of Optimal Experience (Harper Perennial Modern Cl - GOOD",
        "Price": "$5.68",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Flow: The Psychology of Optimal Experience - Paperback - GOOD",
        "Price": "$3.79",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Dialectical Behavior Therapy Skills Workbook: Practical DBT Exercises - GOOD",
        "Price": "$10.73",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Stoner (New York Review Books Classics) - Paperback By John Williams - GOOD",
        "Price": "$12.21",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Choice Theory: A New Psychology of Personal Freedom by Glasser, William",
        "Price": "$5.45",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Master and His Emissary: The Divided Brain and the Making of the West - GOOD",
        "Price": "$16.25",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Happiness Advantage: The Seven Principles of Positive Psychology That - GOOD",
        "Price": "$3.81",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "us stock The Psychology of Money by Morgan Housel (2020, Paperback)",
        "Price": "$9.79",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Psychology For Dummies - Paperback By Adam Cash - GOOD",
        "Price": "$4.57",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I got this book as one of four as a gift for my brother. He is really interested in psychology, and I thought this book would be a great entry for him into the realm. He has not quite gotten to it, but I'm sure he'll love it.",
            "Obtained my Bacherlor's in Psycholgy in 2015.  I am using this book to refresh what I learned. It is simple and real.  The only negative is that this book was dirty.",
            "Simply explained concepts. Great price. Good shape. Happy purchase!!!!",
            "Interesting and informative book thanks 🙏",
            "perfect condition"
        ],
        "Rating": "5"
    },
    {
        "Title": "American Psycho - Paperback By Ellis, Bret Easton - GOOD",
        "Price": "$6.39",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Oh yes, psychopathy/sociopathy is thriving in the USA.  Deja vu, the soulless yuppies depicted in this book have lately been overrun by rebel flag waving rednecks, but whether 1% or not, the general mood is the same - sneer at the homeless, worship Trump, and spend outrageous amounts of money in order to feel good about yourself.  Seeing as people routinely get away with murder (and worse crimes against humanity) these days, it doesn't seem that much is changed.  The dreary obsessive descriptions of what everybody is wearing gets really old, but if we mentally replace that with an obsession with technology and what brand gadget everyone is holding, its a pretty seamless transition between then and now - we definitely value stuff over people.",
            "The novel itself feels too long and while it is well written, I at most found it entertaining, it never felt like a dark comedy or even gallows humor. When it is dark, it's just that. I find it far too sinister to be funny. The parts that could be funny are repeated so much that they become tedious. But the way Ellis writes makes up for this, greatly. I don't feel as if Patrick Bateman becomes and interesting character until serious mental cracks begin to show. But, all in all, the novel's ending is far better than it's beginning, however lacking the humor may be.",
            "Book is better than the movie",
            "The item is great! Matches the description, super excited to read!",
            "The story was set in the mid-1980s, but it could just as easily be set it our modern era, minus Ronald Reagan.\nVery interesting how many times Trump was mentioned. \nAfter reading this book you might gain an appreciation of your local financial psycho. Just remember not to visit him at his swank, postmodernist condo."
        ],
        "Rating": "4"
    },
    {
        "Title": "Psychology: A Very Short Introduction - Paperback By Butler, Gillian - GOOD",
        "Price": "$3.48",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Body Keeps the Score : Brain, Mind, and Body in the Healing of Trauma by...",
        "Price": "$6.80",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Very good read. In this book, author Bessel van der Kolk, M.D. contends that many psychiatric patients are misdiagnosed, largely because those who determine the content of the DSM have chosen not to include a Developmental Trauma Disorder diagnosis. Without the clinician's option to diagnose Developmental Trauma Disorder, patients may be misdiagnosed as having ADHD, bipolar disorder, borderline personality disorder, and many other anxiety-related labels, he says. He explains that a more accurate  diagnosis could lead to more practical treatment. Citing numerous research studies, van der Kolk establishes a connection between mind and body and relates said connection to trauma at various stages of life -- from childhood abuse and neglect to war-related PTSD. Part of the joy of the read is van der Kolk's fairness in granting that some treatments such as eye movement desensitization reprocessing (EMDR) aren't yet fully understood even though they seem to be beneficial to many patients. Another part of the joy of the read is that the narratives and case studies sprinkled throughout the text keep the action flowing in a sea of statistical evidence. I'd recommend this book to clinicians, teachers, doctors, nurses, policemen, firemen, war veterans, parents, grandparents, and almost everyone else as I suspect we all either deal with our own trauma or know people who, as a result of their trauma, create chaos in others' lives. This book is enlightening and promotes hope for those who have experienced trauma.Read full review",
            "This book had fascinating illustrations of how trauma affects a person not only psychologically, but physically.  It makes you understand why some people are the way they are---anti-social personalities, people with anger management issues, etc.  It also gives some compelling evidence of unconventional therapy techniques that have shown great promise but discusses how our society seems to prefer lifelong treatment of a problem with drugs rather than treating the underlying cause and freeing a person from the burden of trauma that they carry with them throughout their lives.  The author is a psychiatrist who specializes in treating trauma patients from early childhood through adulthood.  Fascinating!",
            "I have PTSD and have been in therapy for 16 years.  This book is a must read for sufferers and help providers alike.  It is written by an extremely well qualified  research scientist with many years of treating and research.  The case studies are very interesting.  He provides information from the medical and clinical viewpoint.  The information on treatments and medications are very interesting.  As a patient I find the history of treatment and discoveries of great interest as I have seen the developments from the patient side.",
            "This is a really great book that explains how trauma damages people. The brain doesn't heal from trauma unless it's \"taught\" to (this isn't in the book, it's my own opinion after 25 years of being a therapist.\" This is a great book that's eye opening and healing for many who have experienced any form of trauma. Some reactions are trauma based and some are psychiatric. There is a difference.",
            "Finally, here is writing about the history of the PTSD diagnosis and how it came to be.  And the compassion and caring that these psychiatrists and therapists and researchers express for their patients/clients is very touching.  To me, it's as good a book as \"The Road Less Traveled\" by M. Scott Peck, MD.  Easy to read, lots of case histories that actually make sense, and are to the point, and the history of research into causation and the relationship between early childhood trauma, and how the brain adapts in order to \"function\" after it interprets the trauma.  Researchers are actually developing standards for measuring what used to be thought of as \"immeasurable\".  As an accountant and financial analyst, it's the kind of stuff I LOVE!"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Education of Will : A Mutual Memoir of a Woman and Her Dog by Patricia B....",
        "Price": "$9.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "1995 \"PSYCHOLOGY - AN INTRODUCTION\" PAPERBACK BOOK (P5)",
        "Price": "$6.34",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Give and Take : Why Helping Others Drives Our Success by Adam. Grant (2014,...",
        "Price": "$3.49",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Excellent",
            "This is a really insightful book into the interaction of economic theory and philantrophy.",
            "Shipped quick and great value",
            "Excellent Book… Adam is informative, inspiring, entertaining and right on.  Spread the Aloha! Will be giving a few copies for Christmas!"
        ],
        "Rating": "5"
    },
    {
        "Title": "Atomic Habits: Tiny Changes, Remarkable Results - softcover - New",
        "Price": "$10.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "I found it to be very useful in learning to break goals down into smaller pieces so you can accomplish them -- without feeling overwhelmed.  I also bought the online version so I can read when I'm waiting for appointments. But I found that I preferred the hard cover copy so I can write notes and go back and forth easily. I have ADD, so this is one of the first books I've found easy to follow.",
            "I just received this book & I've only had a chance to read a few pages.  My granddaughter, daughter-in-law & therapist friend highly recommended this book.  What I heard from them & what I have read; it is clear that this book is an instrumental tool to break old habits & move forward with new ones.  Based on what I know so far, I recommend this book!  Wishing you good mental health!",
            "Awesome book - admittedly only part way through. Any book like this that provides a good long look at how our brains work should be read by anyone who wants to become better. And that's what it's about. Real, practical insight on understanding yourself, and making becoming who you want to be. Very solid and well written.",
            "This grabs interest right away and makes some very valid points and suggestions. I am not finished reading it yet but really recommend it. I am glad it was recommended to me and I bought it.",
            "Gives examples how to implement the various suggestions for improving your life.\n\nPractical simple thoughts that make sense."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Psychology Book (Big Ideas) - Hardcover By Nigel Benson - GOOD",
        "Price": "$5.85",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "USA STOCK The Body Keeps the Score : Brain, Mind, and Body in the Healing of tr.",
        "Price": "$10.00",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Very good read. In this book, author Bessel van der Kolk, M.D. contends that many psychiatric patients are misdiagnosed, largely because those who determine the content of the DSM have chosen not to include a Developmental Trauma Disorder diagnosis. Without the clinician's option to diagnose Developmental Trauma Disorder, patients may be misdiagnosed as having ADHD, bipolar disorder, borderline personality disorder, and many other anxiety-related labels, he says. He explains that a more accurate  diagnosis could lead to more practical treatment. Citing numerous research studies, van der Kolk establishes a connection between mind and body and relates said connection to trauma at various stages of life -- from childhood abuse and neglect to war-related PTSD. Part of the joy of the read is van der Kolk's fairness in granting that some treatments such as eye movement desensitization reprocessing (EMDR) aren't yet fully understood even though they seem to be beneficial to many patients. Another part of the joy of the read is that the narratives and case studies sprinkled throughout the text keep the action flowing in a sea of statistical evidence. I'd recommend this book to clinicians, teachers, doctors, nurses, policemen, firemen, war veterans, parents, grandparents, and almost everyone else as I suspect we all either deal with our own trauma or know people who, as a result of their trauma, create chaos in others' lives. This book is enlightening and promotes hope for those who have experienced trauma.Read full review",
            "This book had fascinating illustrations of how trauma affects a person not only psychologically, but physically.  It makes you understand why some people are the way they are---anti-social personalities, people with anger management issues, etc.  It also gives some compelling evidence of unconventional therapy techniques that have shown great promise but discusses how our society seems to prefer lifelong treatment of a problem with drugs rather than treating the underlying cause and freeing a person from the burden of trauma that they carry with them throughout their lives.  The author is a psychiatrist who specializes in treating trauma patients from early childhood through adulthood.  Fascinating!",
            "I have PTSD and have been in therapy for 16 years.  This book is a must read for sufferers and help providers alike.  It is written by an extremely well qualified  research scientist with many years of treating and research.  The case studies are very interesting.  He provides information from the medical and clinical viewpoint.  The information on treatments and medications are very interesting.  As a patient I find the history of treatment and discoveries of great interest as I have seen the developments from the patient side.",
            "This is a really great book that explains how trauma damages people. The brain doesn't heal from trauma unless it's \"taught\" to (this isn't in the book, it's my own opinion after 25 years of being a therapist.\" This is a great book that's eye opening and healing for many who have experienced any form of trauma. Some reactions are trauma based and some are psychiatric. There is a difference.",
            "Finally, here is writing about the history of the PTSD diagnosis and how it came to be.  And the compassion and caring that these psychiatrists and therapists and researchers express for their patients/clients is very touching.  To me, it's as good a book as \"The Road Less Traveled\" by M. Scott Peck, MD.  Easy to read, lots of case histories that actually make sense, and are to the point, and the history of research into causation and the relationship between early childhood trauma, and how the brain adapts in order to \"function\" after it interprets the trauma.  Researchers are actually developing standards for measuring what used to be thought of as \"immeasurable\".  As an accountant and financial analyst, it's the kind of stuff I LOVE!"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Road Less Traveled, Timeless Edition: A New Psychology of Love, Tradi - GOOD",
        "Price": "$4.01",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "The author, Dr. Peck, says it like it is. The most helpful idea he presents is that we as adults have to become dedicated to reality.\n\nThis is not easy. We all have some kind of bias. We all distort reality. We all are excellent at self deceit, which is why dedication to reality is difficult and most important.\n\nFar too many people are closed minded. Dr. Peck says we need to be mapmakers. The terrain of life changes all the time. Instead of putting Gideon Bibles in motel rooms, they need to put this book.",
            "Although this book was written in the 70's, much of the content is just as applicable today. Easy to read, it will challenge a lot of your conceptions about yourself and others. Highly recommend.",
            "Awesome book, wish I heard about it sooner, but you are never to old to learn.",
            "A great book despite its age. Dr. M. Scott Peck is a great writer. Recommend!",
            "I haven't had time to read this yet, but it is famous and suppose to be very good"
        ],
        "Rating": "5"
    },
    {
        "Title": "Flow: The Psychology of Optimal Experience - Paperback - GOOD",
        "Price": "$3.79",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Great book, with a scientific approach to a \"stay in the present\" yogi motto.\nEnjoyed it very much. It could be a little bit dense for a curious, occasional reader. But if you like the theme and are really interested, it's a great red. Recommended.",
            "I’ve only ready 5 pages and the book is amazing it has also increased my vocabulary.",
            "This was a gift for a family member. He loves it and cannot stop recommending it.",
            "Great book for understanding the psychology behind living actively.",
            "The content speaks to issues which are so current today and how each individual  reacts to and interprets each issue."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Parasitic Mind: How Infectious Ideas Are Killing Common Sense by Saad, Gad",
        "Price": "$14.66",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Its time to understand your cognitive surroundings.  This book will help you both understand the madness that is going on and fortify your mind against it.",
            "Very good book."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Anxious Generation : by Jonathan Haidt Hardcover",
        "Price": "$18.65",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Every parent should read this book",
            "I bought two books for my two families with  adolescent and teen children.",
            "Prompt and as promised"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Road Less Traveled: A New Psychology of Love, Traditional Values, and - GOOD",
        "Price": "$3.73",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This is one of the \"best\" books that I have read. I am an avid reader and I find that occasionally I will find a book that is well written, the author speaks in clear, understandable terms and  who is accurate with their evaluation and conclusions.    Dr. Peck is remarkable in this area.                                         Among the hundreds of books that I've read, I rate this one in the top 2% on the bell curve.                                    Sincerely,                                                      Dr. Linda Razza\n\n\nNEWS FLASH !!!!!! My brother Bruce introduced me to a nerw author ~ Matthew Kelly ~  This gentleman has blown me away with ~ \"Thre Rhythm of Life\" ......A MUST TO READ !!!   Sorry M. Scott Peck, but there's a new Einstein in town !!!",
            "Who can say anything negative about a book whose first line is \"Life is difficult\"? Starting with this truism, Dr. Peck in this older but still very relevant book, shows that not only can mental health and spiritual growth be coupled but are one in the same.\n\nHaving worked in the field of mental health for over thirty years I am amazed at some of the naive statements I hear about the secularism of mental health. Without values and learning about others we have no society--only anarchy. In the same vein, an individual without values and compassion is isolated and, in most cases, meets the definition of mental illness.\n\nFor once and for all, let Dr. Peck walk you through such chapters as love, grace and commitment. It is when we are able to find a way to let go of our expectations and learnto accept life that we can truly enjoy this wonderful walk together.\n\nRecommended reading for all--a must for any health care professional or religious leader !!!Read full review",
            "A classic in self-help therapy textbooks.  Still a valid paradigm for treating shame-based psychological disorders and helping to guide those with personality disorders to find their way forward to healthier living and self-acceptance in an age of endless anxiety.",
            "I have read this book several times over the years, & it has been a great help.  I keep giving it away to friends in need, so from time to time I buy a new (or gently used one).  It continues to be a most helpful book.",
            "Reluctently I first read this book over 30 years ago when it was assigned in school. It has become one of my all time favorites!  When I am having difficulty in my life with one thing or another I crack the book open and read!  It has helped me to discern which path I need to take.\r\nI recommend that everyone get a copy of this enlightening, up to date and inspiring book and keep it on hand.  I have also bought it in bulk and given it to people that i felt could benefit from it the way I have!\r\n\"Life is difficult\"  but \"The Road Less Traveled\" helps!!!!"
        ],
        "Rating": "5"
    },
    {
        "Title": "Bad Therapy : Why the Kids Aren't Growing Up by Abigail Shrier (2024, Hardcover)",
        "Price": "$18.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "My daughter couldn’t put it down.",
            "Great eBay-er!!"
        ],
        "Rating": "5"
    },
    {
        "Title": "us st. Adult Children of Emotionally Immature Parents: How to Heal from Distant",
        "Price": "$10.00",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Very grateful for this book as it gives me alot of validation that I am not alone with what I have experienced throughout my 34 years of life, growing up with emotionally immature parents and family members.\n\n Alot of self-realization and self-actualization that I have been going through these last 10 years during and after college is very parallel with what the author speaks about in her book.\n\n Highly recommend for anyone who struggles with self-identity and lack of self-esteem and confidence due to being neglected emotionally by self-centered parents.",
            "This book has been extremely helpful. I actually found myself described too a tee. Planning to read it a second time to be sure I got everything that's there for me. Many thanks to the author.",
            "This book changed the way I viewed a lot of things about my own life. It is so well-written, easy to follow and informative. One of my best book purchases yet.",
            "3 chapters away from finishing this book and it has been so validating. I’ve highlighted so much of this book as it has described my family and my childhood so well it is as if someone wrote the book specifically for me. To me this means that this is something many people experience and therefore anyone who has any interest in understanding themselves & family should read it. \nThis book is a great gateway into understanding childhood trauma and can lead you into healing and understanding as well as more research into why you are who you are and how to grow from this information.",
            "My freaking childhood -- seriously.\n\nDid you, also, have to parent your own parents?  Read about internalizers, externalizers, and the roles many of us born to immature adults were forced to play.\n\nCompelling.\n\nFascinating.\n\nSuperb read -- I keep a copy on hand at almost all times. (Seriously.)"
        ],
        "Rating": "5"
    },
    {
        "Title": "Flow: The Psychology of Optimal Experience (Harper Perennial Modern Cl - GOOD",
        "Price": "$5.68",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Aside from being a typical marketably charismatically cathartic read; the author emphasizes a great deal of balance between a challenging resistance and pragmatic ease of execution of skills that elicit enjoyment. Essentially; he defined an autotelic nature to be conducive to being a self-regulating individual focused on pertaining interests.",
            "As described",
            "it is a good book to read, particularly to find your passion when you dont know what to do in your life.",
            "Very good"
        ],
        "Rating": "4"
    },
    {
        "Title": "Brand New - 101 Essays That Will Change the Way You Think by Brianna Wiest",
        "Price": "$10.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Succinct, easily digestible self-improvement content."
        ],
        "Rating": "4"
    },
    {
        "Title": "Leonardo Da Vinci by Walter Isaacson (2017, Hardcover)",
        "Price": "$5.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Speed was fast and quality is great. My only wish is that it wouldn’t look like a library book. Not a fan when libraries either take out covers or tape them out, aka put clear cover on cover. Last part is not as irritating as no covers. Overall, been looking forward to reading Leo’s biography by this author and happy witj my purchase",
            "Mr. Isaacson has that rare gift of being able to write compelling narratives about compelling history and compelling personalities who have changed the world with their vision and talents.  Once I pick up any one of the books written by Isaacson, I am lost to the world!",
            "I truly loved this book! Thoroughly researched and very well written, it gave me new appreciation for Leonardo da Vinci. There is no trace of the tortured artist to be found. Rather, he was a perfectionist and at the same time, a pleasant man who was thoroughly comfortable in his own skin, He was extremely curious about EVERYTHING. His discoveries were numerous. I highly recommend this book.",
            "I've read several of Isaacson's books and this one is consistent with this past quality work.",
            "Just as he has done with other luminaries in history, Isaacson’s biography of Leonardo was thoroughly researched and thoughtfully written. He was able to include many sketches, diary entries and notes that I would otherwise never be able to see. I recommend this book to all artists and historians. It is a precious insight into the complex mind of a genius."
        ],
        "Rating": "5"
    },
    {
        "Title": "Combo Set Of 2 books (The Psychology of Money + Atomic Habits) Free Shipping",
        "Price": "$18.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Trauma Spectrum : Hidden Wounds and Human Resiliency by Peter Levine and...",
        "Price": "$18.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Combo book set of Same as Ever Psychology of money & Atomic Habits New Stock",
        "Price": "$28.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Dark Psychology and Manipulation: Dark Psychology and Manipulation: Discover 40",
        "Price": "$20.61",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Courage To Be Disliked (PaperBack) - Ichiro Kishmi and Fumitake Koga",
        "Price": "$11.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Memories, Dreams, Reflections - Paperback By Jung, C. G. - GOOD",
        "Price": "$7.23",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "A moving and thoughtful recounting of insights and life experiences from a humble, gentle shepherd of the human soul. If you are \"stuck\" in your life, there's an alchemy in the reading of this book that will move you to the inmost core of your being.\nAlthough not technically a book for the newbie to psychology, Jung's clarity of expression, along with an excellent little dictionary of unfamiliar terminology, make this book accessible to most anyone who has the patience to read it carefully. That patience will be rewarded with  deep and stirring information regarding what it means to be fully human.\nAlthough a few concepts are dated, Jung was amply apologetic as to his humanity and possible errors of judgement. This ultimately makes the material still as poignant and valuable as it was at the time it was written, and maybe even more so in the pervasive atmosphere of anomie humanity faces today.Read full review",
            "Carl Jung is one of the most lucid, imaginative and far-seeing minds of the millenia, and this book is a glimpse into the back rooms of that amazing thought process. What was he really like as a child?  What did he think about?  How did those early experiences form the man who had such a profound impact on the field of psychology?  The reassuring part of this biography is how readable it is, especially the first three chapters, which were written by Jung himself.  This is a volume I will return to again and again, and should be required reading for everyone who seeks to understand the extraordinary journey of the questioning mind.",
            "I enjoyed the openness of Carl Jung's autobiography and his provocative observations of society.",
            "Thank you and I appreciated you leaving the letter from the last owner of the book and the section they wanted somebody to read"
        ],
        "Rating": "5"
    },
    {
        "Title": "us stock ATOMIC HABITS (PAPERBACK) - JAMES CLEAR-Free shipping.",
        "Price": "$9.78",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Mindset: The New Psychology of Success by Dweck, Carol S.",
        "Price": "$4.09",
        "Author": "by Dweck, Carol S. | PB | VeryGood",
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Dialectical Behavior Therapy Skills Workbook: Practical DBT Exercises - GOOD",
        "Price": "$10.73",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This book is so practical, clear and effective.  It has tons of compelling information and exercises to help anyone with volatile emotions and behavior to feel better and improve their outlook, and their ability to relate to others, especially in difficult circumstances.",
            "I really enjoyed this book. A lot of great alternatives to \"just meditate\" for those of us who aren't big into (or can't) meditate.",
            "Love the explanations and the worksheets. Nice, clear and concise!",
            "Delivered immediately, best deal on market."
        ],
        "Rating": "5"
    },
    {
        "Title": "How to Think More Effectively",
        "Price": "$9.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Road Less Traveled Set : A New Psychology of Love, Traditional Values,...",
        "Price": "$2.79",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "This is one of the \"best\" books that I have read. I am an avid reader and I find that occasionally I will find a book that is well written, the author speaks in clear, understandable terms and  who is accurate with their evaluation and conclusions.    Dr. Peck is remarkable in this area.                                         Among the hundreds of books that I've read, I rate this one in the top 2% on the bell curve.                                    Sincerely,                                                      Dr. Linda Razza\n\n\nNEWS FLASH !!!!!! My brother Bruce introduced me to a nerw author ~ Matthew Kelly ~  This gentleman has blown me away with ~ \"Thre Rhythm of Life\" ......A MUST TO READ !!!   Sorry M. Scott Peck, but there's a new Einstein in town !!!",
            "Who can say anything negative about a book whose first line is \"Life is difficult\"? Starting with this truism, Dr. Peck in this older but still very relevant book, shows that not only can mental health and spiritual growth be coupled but are one in the same.\n\nHaving worked in the field of mental health for over thirty years I am amazed at some of the naive statements I hear about the secularism of mental health. Without values and learning about others we have no society--only anarchy. In the same vein, an individual without values and compassion is isolated and, in most cases, meets the definition of mental illness.\n\nFor once and for all, let Dr. Peck walk you through such chapters as love, grace and commitment. It is when we are able to find a way to let go of our expectations and learnto accept life that we can truly enjoy this wonderful walk together.\n\nRecommended reading for all--a must for any health care professional or religious leader !!!Read full review",
            "A classic in self-help therapy textbooks.  Still a valid paradigm for treating shame-based psychological disorders and helping to guide those with personality disorders to find their way forward to healthier living and self-acceptance in an age of endless anxiety.",
            "I have read this book several times over the years, & it has been a great help.  I keep giving it away to friends in need, so from time to time I buy a new (or gently used one).  It continues to be a most helpful book.",
            "Reluctently I first read this book over 30 years ago when it was assigned in school. It has become one of my all time favorites!  When I am having difficulty in my life with one thing or another I crack the book open and read!  It has helped me to discern which path I need to take.\r\nI recommend that everyone get a copy of this enlightening, up to date and inspiring book and keep it on hand.  I have also bought it in bulk and given it to people that i felt could benefit from it the way I have!\r\n\"Life is difficult\"  but \"The Road Less Traveled\" helps!!!!"
        ],
        "Rating": "5"
    },
    {
        "Title": "Man's Search for Meaning - Paperback By Frankl, Viktor E. - VERY GOOD",
        "Price": "$7.64",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I have read this book four tmes and each time I find it to be even more engaging and enlightening.  Thirty years ago I taught in a men's prison in Hawaii.  I passed around two copies of this book to my inmates.  It was so applicable to their situation.  This is the fifth time I have purchased this book because I lend it to friends and then they lend it to friends......  Well worth the purchase price which is very reasonable.",
            "I have wanted to read this book for years because I've heard so many good things about it, so I finally bought it and dove right into reading it. I was sorely disappointed, I ended up only getting half way through the book before I decided not to finish it. I didn't enjoy the way it was written.  I didn't feel like it flowed very well and I didn't enjoy the way the author told his story. It wasn't engaging or inspirational to me like \"The Hiding Place\" or \"The Choice\" were.",
            "Fantastic book about a psychiatrist who was in a concentration camp had to overcome pain and suffering (plus the chance of not surviving) and become a better and happier person.",
            "A deeply personal account of a tragic experience. He doesn’t give up or become cynical but extrapolates from that experience lessons we should all ponder. His vision is positive and he exalts human dignity.",
            "Frankl\"s life & experience gave him wisdom and determination that allowed him to provide excellent guidance for handling difficulties we encounter in our lives.  Three years in Nazi concentration camps and surviving followed by a life of introspection and teaching makes his wisdom invaluable."
        ],
        "Rating": "5"
    },
    {
        "Title": "Morgan Housel Collection 2 Books Set Same as Ever + Psychology of Money PB",
        "Price": "$18.00",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Psychology of Money : Timeless Lessons By Morgan Housel NEW Paperback 2020",
        "Price": "$12.85",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Heavily informative. Currently still reading, it's slightly entertaining with some anecdotes but rather focused upon details. Still have yet to fully finish but it's life changin!",
            "Great book and easy to read and put down temporarily.",
            "This is a must read if you want to learn and control your money",
            "The book came in like new condition.  The content is compelling and entertaining.  I recommend it.",
            "Great insight into how people behave with their money"
        ],
        "Rating": "5"
    },
    {
        "Title": "Essentialism: The Disciplined Pursuit of Less - Hardcover - GOOD",
        "Price": "$4.90",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "The book is a plea to all those with busy lives to look at what is most essential to them and build a life around it before it is too late. The book provides some simple guidance from how to put aside time, how to figure out what is important and how to edit your life or the things that are not contributing to your vision.",
            "You should read this. It has clarified and de stressed my life- and the clarity may also offer this opportunity to you!",
            "I have not read this book yet but it come highly recommended.I have my copy sitting at the top of the pile to read next.",
            "I watched a short video on YouTube featuring Greg McKeown and knew that I must purchase his book on eBay. I was not disappointed. The book \"Essentialism - The Disciplined Pursuit of Less\" isn't about getting more done in less time. It is more about getting only the right things done. The lessons taught and the examples shared give a clear path to determine what is essential in our lives and business and to reclaim control of our choices. Highly recommended.",
            "Found the ideas contained powerful-- it could have been much shorter though."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Creative Act : A Way of Being by Rick Rubin (2023, Hardcover) USA item",
        "Price": "$15.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Super great price for this in demand book. I appreciate it.",
            "Most inspiring book I’ve read in awhile!"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Happiness Advantage: The Seven Principles of Positive Psychology That - GOOD",
        "Price": "$3.81",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I have this audio book and I've listened to it many times. I bought the book because listening to it isn't enough. The content is great and the author is pretty funny. I originally heard of the author via a TED talk. The principles he relates in this book are compelling and the evidence supporting them is solid. Like a lot of these 'self-help' books, the things he says to do to make yourself happy are not necessarily new or surprising--but it's written in a way that makes it easy to apply in your own life. This is a book you can and should read multiple times to really get the most out of it.",
            "I have heard this author speak and this book expanded on his ideas contained in his speech.",
            "Looking for a new perspective and a way to better myself and my life. This book changed my way of looking at happiness and success.",
            "This book is great. It tries to reform the current view of psychology to a positive manor instead of focusing on the negative aspects.",
            "Everyone needs to read this book. It is helping me improve my life and my happiness! Thank you so much"
        ],
        "Rating": "5"
    },
    {
        "Title": "Sarah Fergie Dark Psychology and Manipulation (Paperback)",
        "Price": "$12.25",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Leaders Eat Last: Why Some Teams Pull Together and Others Don't - GOOD",
        "Price": "$6.12",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "True&Fast…..Great book,.\ncover was tore but repaired with tape.",
            "It looks like new. There a really good reasoning behind the concepts that Mr. Sinek brings up.",
            "Top"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Woman in Cabin 10 - Paperback By Ware, Ruth - GOOD",
        "Price": "$3.98",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Don’t know how these authors think of these plots, but this one is very interesting .. different... just could have been told a little better...",
            "With nothing but a lamp, a butter knife and this book...then yes it's a good idea to read it.\n\nIt's a compelling tale but it drags on and really doesn't get crazy interesting until the last chapters.\n\nAnd I'm still wondering about the burglary in chapter one and what the point of that is.",
            "Love this author.  Can’t wait to read a another book of this author.",
            "First Ruth Ware book I've read. Very good plotline. Couldn't put it dowm",
            "heard about the book on Jepardy, believe or not, so as an avid reader I took a chance. I was not disappointed."
        ],
        "Rating": "4"
    },
    {
        "Title": "The Mindfulness and Acceptance Workbook for Anxiety: A Guide to Breaking  - GOOD",
        "Price": "$3.94",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This is a very comprehensive and practical workbook for anyone who has anxiety or works with individuals who have anxiety.  It is well-written and easy to utilize for many levels and types of anxiety",
            "Was a good workbook, that gave you tips and ideas to use to help yourself, btter than going and paying a counselor to do the same every week.  Atually she was the one who told me to buy it",
            "Starts off like a sales advertisement, but then gives a good, helpful method."
        ],
        "Rating": "5"
    },
    {
        "Title": "Emotional Intelligence: Why It Can Matter More Than IQ - Paperback - GOOD",
        "Price": "$3.95",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "A great book. We all need to read it to value our own emotional, try to understand ourselves first then we CAN HELP OTHERS.  Thanks. Jinghui Russell",
            "Great book with interesting perspectives. Arrived fast. Very happy with this purchase.",
            "A very good read. It helps in understanding how being understanding and listening will help develop relationships and being successful in those relationships.\n\n\nJFKJR",
            "Important information that would be helpful in day to day relations, food for thought.",
            "I'm very happy with my purchase and the speed I got my book."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Anxious Generation: How the Great Rewiring of Childhood Is Causing an Epidem",
        "Price": "$7.73",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Tuesdays with Morrie: An Old Man, A Young Man and Life's Greatest Lesson - GOOD",
        "Price": "$4.08",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This is one of the best books I have read in a long time.  I highly recommend it.  In fact, I have purchased extra copies to share with my friends, so they can enjoy it too.",
            "I bought this book as a christmas gift for my mother, who loves reading, and has made it clear she doesn’t care if we get her used books as long as its in good condition. Personally, my price range is limited but when i saw this i was excited because it was very cheap and the description said “Very good -  has been read but looks new”. Seemed like a steal until i got it. if i were selling this book i would label it as FAIR condition. it was a hardcover, and the book jacket was stained and disgusting looking, along with the spine showing the pages, as if someone spilt something on it. like i said, i knew the book was used & i expected some minor wear & tear, but i dont think it should have been considered VERY GOOD condition when it was clearly only FAIR. Unhappy and will probably have to remove the jacket when I give the gift because its a little embarrassing.Read full review",
            "I can make it simple. The product stank like a seven-day-old in a septic tank. I don’t know where the seller stored the book, but that place should be condemned by law. After I opened the package, not only did the putrid smell pour out like the explosion of a newly active volcanos, but the offensive fragrance lingered for several days. I live in a room less than the size of a prison cell. I don’t need help making it smell bad. I work every day to make it smell good. I sprayed the product with Lysol, but not so much as to spoil the the print. To this day, whiffs of it’s odorous being exist in my home.",
            "I've heard several reviews of the book and wasn't compelled to read it until I learned how the book/story came to be. The author's candid details of what is considered by most to be one of life's 'peripheral' relationships, comes full-circle and gives the reader a strong 'curtain-call' message, long before intermission. It touches on every emotion at some point and will have you making comparisons to your own life, by the end of the first 'Tuesday'. We tend not to notice certain important things in life which don't yet 'apply' to us but in the end, this story applies to everyone and to read it earlier rather than later, is a gift. Death is certain for all of us and as a frightening thought for most, we simply do our best to pretend it's not out there. In my opinion, this book is an answer to the \"What if...\". If you don't feel anything by the end of the second 'Tuesday', you may be numb. I strongly recommend you re-read, and finish the book. It's a bit like a cold splash of reality, which oddly, leaves you feeling covered in a warm blanket.Read full review",
            "My daughter passed away in her twenties and I was having a hard time adjusting to life. I was reading every single book possible. THEN, I came across this book \" Tuesdays with Morrie \" and it answered everything about life, love, family, getting older, self esteem, and with loving and holding on to respecting yourself all through everything in what life gives you in the ups and downs . Mitch Albom, the Author, says it in such an excellant way from what Morrie has told him and how Morrie has felt it in his own life. This book will bring you up if you are down and this book will help you understand life and yourself and people . I LOVE this book. This is my FAVORITE ! I even have it signed by the Author himself . This book helped me go to sleep calmly after my daughters death, and understandso much about life itself . YOU WILL READING LOVE IT !! I highly recommend this book!Read full review"
        ],
        "Rating": "5"
    },
    {
        "Title": "Man's Search for Meaning - Mass Market Paperback By Frankl, Viktor E. - GOOD",
        "Price": "$6.87",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I bought this book as a Christmas gift. I read it many years ago and it had a profound affect on me concerning humanity, love and crisis. It's a book everybody should read once in their life. It is truly life changing.",
            "This dark part in our history as humans should be MANDATORY READING for high school and/or college students.",
            "We all search for meaning in our lives, it's a built in human feeling that we all have no matter our background, religion or social status. Unfortunately in our modern world, because of its fast pace and stress on \"making it\" we tend to forget or are just \"too busy\" to think what really counts in our lives.\r\nThe author, a Psychiatrist (and at first a colleague of Freud) and a Shoa survivor was able during his time in a concentration camp able to observe how people reacted in a most deprived physical surrounding. WHo were the people most likely to survive, and who died with meaning. He found out the answer and this book was a result of his discovery.\r\nIt's not easy reading, you have to really THINK when you read this book. It may change your life and perspective of reality, but the reward will be eternal! I highly recommend it. It should be a must reading in every school and university.Read full review",
            "This novel used to be part of the Theology curriculum at my school but as an English teacher, somehow it ended up in my course of study.  I highly recommend that this be read at the high school or college level.  Frankl's position is that man does not seek pleasure above all else as Freud believed, or power, as Adler believed, but meaning.  Life needs to hold a purpose.  When life lacks meaning, and people find themselves without meaningful relationships or goals, they may experience what Frankl refers to as the \"existential vacuum\" -- a condition that he applies to excessive drug use and suicide.  \r\n\r\nThis novel, following Frankl's experiences in a concentration camp, was originally written in 1959, but definately applies to our world today. Frankl's \"meaning\" in the camp essentially became the creation of this novel.  The importance of Frankl surviving, and eventually writing this book is what provided his meaning.  While in the camps, however, Frankl also studied the resilience or despair of his campmates, analyzing why some survive and others give up.  The book provides a fascinating study of the human body and mind's ability to withstand extreme conditions.  Personally, it provided me with a strong sense of security, assurance, and hope in the event that I find myself in such severe conditions; however, the tenets of \"logotherapy\" which Frankl discusses in more detail toward the end of the book, are ideas that I find myself returning to and applying to everyday stressors as well.  \r\n\r\nAlthough many of my high school students found some of Frankl's ideas and terminology a bit difficult, most have confirmed that this novel was the most significantly valuable part of the course I taught.Read full review",
            "This is a fast and easy read, not too long, but the lessons you get from this book can last a lifetime. One of the most inspiring and deeply meaningful books I've ever read. A triumph of the human spirit! Dr. Viktor Frankl's message may be critically important to many of us in the future, should any of us have to face trauma and brutality at the hands of others. A tool for healing and regeneration of the spirit. There are bad people in the world, or good people acting badly. But humanity redeems itself in the lives and actions of people like Frankl. My favorite part of this book is where Frankl is interviewing a dying woman, and she tells him that she is having a dialogue with the tree, outside the window. Thinking that she is delusional, he asked her what the tree is saying. She responds:\"I am life, everlasting. I am here, I am with you\" (paraphrased). I would also recommend Corrie Ten Boom's 'The Hiding Place', and 'In My Hands', by Opdyke. All are fascinating books and deeply enriching to the soul!Read full review"
        ],
        "Rating": "5"
    },
    {
        "Title": "Blink: The Power of Thinking Without Thinking - Hardcover - GOOD",
        "Price": "$3.96",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "In Blink, Malcolm Gladwell offers his account of humanity's seemingly instantaneous judgment in critical situations.  The book features a series of fascinating anecdotal case studies, skilled interweavings of psychological experiments, explanations, and unexpected connections which have become part of Gladwell's writing style since Tipping Point.\r\n\r\nAt the outset of Blink, he illustrates how incredibly complex decisions are often made in the matter of seconds: experts on Greek art, who had no vested interest in judging a rare 6th-century sculpture of a youth as authentic, sensed immediately that it was fake.  But Gladwell points out that if expertise, or mere accumulated experiences sufficed, humans could unerringly trust these decisions made as rapidly as the blink of an eye, but, as he illustrates through several counterpuntal stories, such blinks can also be deceptive.   It should be noted that he seems to stretch some of his examples to conform to his blink-of-an-eye theory. \r\n\r\nGladwell is an impressive synthesizer and is, in that sense, a model for both teachers and students.  Because of his skills as a journalist, the book is accurate and informative -- complete with numerous anecdotes.  Blink is a satisfying and informative read, but not as scholarly as some might have you believe.Read full review",
            "I found this book to be very interesting and one of those books that you don't want to put down. Malcolm Gladwell introduces us to a thinking technique he calls \"thin slicing\", which allows us to make decisions very quickly. As he describes it, thin slicing is the ability or method of paying attention to just a few, key factors, versus weighting multiple variables when making a decision. This is not a how-to book but rather a collection of stories and examples Gladwell has organized that demonstrate thin slicing and it's bets and worst.\r\n\r\nThe stories and examples are fun to read and thought provoking. I found myself analyzing my thinking while reading several of the stories. My only disappointment with the book, and the reason I rated it good instead of excellent is that it doesn't provide any how-to. The examples are great but it would be nice to provide one chapter at the end with tips, exercises, or something that will help you learn to \"thin slice\".Read full review",
            "Blink: The Power of Thinking Without Thinking\n\nThe Entertainment Critic Book Review By James Myers\nBLINK: THE POWER OF THINKING WITHOUT THINKING-By Malcolm Gladwell\nPublished by Back Bay Books,\nLittle, Brown and Company, and\nHachette Book Group USA\n296 Pages\nISBN:  978-0-316-01066-5(Pb)\n(Four Star Rating)****\n\n\n“I think we are innately suspicious of … rapid cognition.  We live in a world that assumes that the quality of a decision is directly related to the time and effort that went into making it.  When doctors are faced with a difficult diagnosis, they order more tests, and when we are uncertain about what we hear, we ask for a second opinion.  And what do we tell our children?  Haste makes waste.  Look before you leap.  Stop and think.  Don’t judge a book by its cover.  We believe thatwe are always better off gathering as much information as possible and spending as much time as possible in deliberation.  We really only trust conscious decision making.  But there are moments, particularly in times of stress, when haste does not make waste, when our snap judgments and first impressions can offer a much better means of making sense of the world.  The first task of Blink is to convince you of a simple fact; decisions made very quickly can be every bit as good as decisions made cautiously and deliberately.”\n\n\nBlink is a brilliant, new and insightful book written by Malcolm Gladwell, staff writer for the New Yorker, former business and science reporter at the Washington Post, and author of another #1 best seller, The Tipping Point.  The premise of Blink is that rapid cognition thought that occurs in the blink of any eye, are powerful and important conclusions that we come to, that should not be ignored, but embraced.  In other words, under some circumstances we can trust our snap judgments, better than we can trust more deliberate, conscious, balanced thought.  Mr. Gladwell teaches us that sometimes when we are under stress and pressure, our snap judgments serve us better that more conscious, analyzed thought.  Human beings have what Gladwell refers to as “the power of thin slicing” which means that human beings have the ability to make sense of situations based upon the thinnest slice of experience.\n\nBlink is also a study of when our instincts betray us and why.  For example the Getty museum purchased a statute that was supposedly constructed in ancient Greece.  They studied it for 14 months with scientific tests and complicated chemical analysis and came to the conclusion that it was authentic.  A few experts that constantly evaluated objects of antiquity glanced at it and based on their experience without performing tests, felt that it was fake.  Getty purchased the statute for $10 Million Dollars.  After many years and much study, Getty finally came to the conclusion that the experts, who just glanced at the statute and sensed that something was off, were right.  The statute was a phony.  The scientists with their machines were wrong, the art experts with their hunches and experience were right.  Gladwell teaches us that our unconscious may be a powerful force, but it is not infallible.  Certain variables can cause our rapid cognition to go awry, and what we need to do is identify those and understand them.  We can learn when to listen to our snap judgments and when we should not.\n\nGladwell demonstrates in the book that our snap judgments and first impressions can be educated and controlled.  We can actualRead full review",
            "You don’t need to read this review.  You’ve already made up your mind about the book Blink.  You’ve received enough inputs from sources that you trust or don’t trust that your subconscious has already decided whether or not Blink is a good book.  If this review agrees with your subconscious, you’ll agree with the review.  If this review disagrees with your subconscious, you will attribute my opinions on this book to my incompetence.  Why and how did you come to make such a hasty judgement on this book ?  “Blink” seeks to answer those questions.\r\n\r\nIn this latest book, Gladwell (of “Tipping Point” fame) explores “thin slicing”, the theory that we only need a tiny bit of information or exposure to something to make a decision.  The genius of Gladwell is that he examines how common people usethin slicing, usually unaware of the fact that they are thin slicing, and that he also examines subject matter experts using thin slicing to practice their chosen art with remarkable accuracy.  Some examples of common people unknowingly thin slicing include speed daters who make remarkably sound choices about dating partners and police officers who, in “Matrix” like fashion, slow down time in the heat of a gunfight to make amazing decisions.  Great examples of experts who practice thin slicing include the ability of a marriage counselor to determine whether a marriage will succeed or fail with 95% accuracy….based on 30 seconds of conversation between spouses.\r\n \r\nIt’s a fascinating book that has the potential to change the way you think about your own thoughts and interpret the actions and reactions of those you interact with.Read full review",
            "This is a typical Malcolm Gladwell book - a good, coherent, layman explanation of the research carried out in the functioning of our brain. In brief, we make conscious well-thought out decisions and unconscious, rapid decisions. The book talks about the power of the latter (and hence the title \"blink\") through several examples. The content is great and the writing is easy to follow. I would strongly recommend this book."
        ],
        "Rating": "4"
    },
    {
        "Title": "The Psychology of Money by Morgan Housel (2020, Paperback) - New & Sealed",
        "Price": "$11.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Heavily informative. Currently still reading, it's slightly entertaining with some anecdotes but rather focused upon details. Still have yet to fully finish but it's life changin!",
            "Great book and easy to read and put down temporarily.",
            "This is a must read if you want to learn and control your money",
            "The book came in like new condition.  The content is compelling and entertaining.  I recommend it.",
            "Great insight into how people behave with their money"
        ],
        "Rating": "5"
    },
    {
        "Title": "Get Out of Your Head: Stopping the Spiral of Toxic Thoughts - Hardcover - GOOD",
        "Price": "$4.79",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "It’s A wonerful book to read! It focuses on how our mind can cause us to spiral and become anxious and depressed! It tells us how we can get these thoughts out do our mind!",
            "It is easy to read and understand. Out ladies group at church is loving it so far.",
            "I haven't really had the time to read,but it looks good!",
            "I have not yet had time to read the book, but I'm looking forward to it",
            "Reading one chapter at a time to think about and digest before moving on!\n“Our emotions are by-products if our thoughts”"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Expectation Effect: How Your Mindset Can Change Your World .. NEW",
        "Price": "$13.75",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Everything I Never Told You - Paperback By Ng, Celeste - GOOD",
        "Price": "$3.77",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Excellent book.  Easy read.  Addresses deep matters in a direct and not-too-heavy manner.  Recommended by my 28 year-old nephew, I'm a 50 year old woman, so good all-around.",
            "I haven't started reading it yet but I am sure I will enjoy it. Celeste NG is my new favorite author. Don't miss \"Little Fires Everywhere\".",
            "Quick,clean, excellent author",
            "It’s such good quality for such a cheap price! I read chapter one so far, and man I just want to keep reading more! So interesting with the characters being different from each other and also keeping secrets from each other. Muy sabroso and fun to read and really really interesting",
            "Kids are cruel!  When  your dad is Chinese and your mother is not your life can be very lonely.\nAn ambitious mother and a father who feels like an outcast definitely project this onto their children.\nEscape is the only answer."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Untethered Soul: The Journey Beyond Yourself - Paperback - GOOD",
        "Price": "$4.99",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "The book is terrific, it explains spirituality in very simple terms. It’s an easy read, practical, and a user’s manual to change one’s life. Am making notes and saving them on my phone as a reminder to practice being conscious at all times. It’s the best therapy one can have, there’s a chance to get rid of all problems that hold us hostage. What a book!!!",
            "The premise is interesting but I have questions about the author assuming his reader’s problems as being so menial they can just go there and get through them so simply.  I Know the pain and will try to face it.  I enjoyed the ride, but never got past this issue.",
            "A friend lent me this book a couple of months ago and it had a dramatic impact on my life. I'm not a self - help book person and have always sought knowledge in literature and academia. I'm also pretty cynical about the many \"life gurus\" out there who capitalize on people's fears for their financial benefit. \"The Untethered Soul\" is different in its abstract approach to topics like fear, anxiety and how to deal with the little voice bleeting inside your head. Singer's voice is never patronizing or smarmy but rather objective and diplomatic. I felt like a new person after reading this and have recommended it to all my family and friends. I even purchased another couple of copies so that the most important people in my life would benefit from its message. I recommend buying it because it's a book  to flick through regularly, to remind you of the many valuable lessons within.Read full review",
            "This book should be required reading for every adult.  What a Spiritual epiphany I felt after reading this book!  Most inspiring book I have read in years.  I can't recommend it more highly.",
            "MUST READ!  By FAR the BEST book on living the MOST FREE, loving and abundant version of ourselves, LIFE free of our pasts and appreciations for the precious moments of Life.   As a stage 4 cancer survivor, this incredible book was FULL of beautiful insights for all types of healing. Recommend to anyone and have shared with my whole family, friend and coaching circles."
        ],
        "Rating": "5"
    },
    {
        "Title": "Lord of the Flies - Mass Market Paperback By William Golding - GOOD",
        "Price": "$3.49",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I've loved Lord of the Flies for a long time, but so many of the covers are absolutely hideous.  This is the cover I've been wanting.  It's a used book, but wear is minimal, and all things considered it's in great condition.  The photographs accurately displayed what I was going to get.  I'm very happy to finally have an appealing cover for this excellent story.",
            "Haven't read this book in 20 years.  Book was in used conditionbu, lightly used...  great value!!!",
            "William Golding’s Lord of the Flies is simply one of the best novels written. The book appears on virtually every Best 100 Books list.\nThe story involves a group of British children who are stranded on a tropical island. They initially organize around Ralph, and begin to prepare their island paradise for survival, while also maintaining a fire to alert any search party of their presence. The group creates rules for their mini civilization.\nConflict begins when Jack organizes his group of “hunters”, rejecting Ralph’s authority. The civilization descends into chaos, and even murder as the hunters challenge Ralph.\nCan society be organized around logic and order? Or is it man’s nature to reject order? Can society (government) rule by consent of the governed, or must it rely on force and the threat of force to maintain order?\nThere have been two film versions of Lord of the Flies , in 1963 and 1990 (as well as other derivative films), both films are excellent.\nRead the book! Watch both films!Read full review",
            "Great deal.  I ended up ordering the book for my daughter's summer English assignment.  All the books were in use at our public library.  Good thing we bought our own copy bc she needed to take cliff notes in the book.  Once she has finished the book, I'll get a chance to read this classic again.",
            "The book price was good for the condition it was in. I purchased it for a student at school who has been required to read it in a class."
        ],
        "Rating": "5"
    },
    {
        "Title": "Surrounded by Idiots (The Surrounded by Idiots Series) PAPERBACK 2020 by Thom...",
        "Price": "$9.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Change Your Brain Every Day",
        "Price": "$14.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "I'm Thinking of Ending Things: A Novel - Paperback By Reid, Iain - GOOD",
        "Price": "$6.64",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "One of the best books I have ever read. Fast paced and thrilling!",
            "It will mess with your own psyche",
            "Great product",
            "THIS BOOK IS CRAZY INTENSE AND I CANT WAIT FOR THE MOVIE TO COME OUT!!!",
            "good. thank you."
        ],
        "Rating": "5"
    },
    {
        "Title": "Thinking, Fast and Slow - Paperback By Kahneman, Daniel - GOOD",
        "Price": "$8.01",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This book teaches you how to think. It teaches you about the glaring weaknesses in the way your mind functions and why it's imperative to be aware of this. It applies these lessons to all kinds of phenomena in our lives, from purchasing decisions to financial markets to how to be healthier. The language is quite easy to understand as well so no excuses there!\n\nIt's eerily applicable to the current political climate in both the USA and UK. Read this book if you care about learning how your brain works.",
            "This is a great read. Insight into our inner workings. A little over my head but that is why I bought it.\n(So I could learn) It is a real learning experience.",
            "I'm just a 100 pages into the book.... toughest part is the beginning.... afterwards it flows well.  Enjoying the new information about my thoughts about how I am making decisions.",
            "An interesting book about the autonomic  body system and the conscious thinking system within a human being.  The conscious human thinking system is what makes humans different than all other living organisms on Earth.  Enjoy.",
            "Wow, what a thorough book on how our brains make decisions. Although the content is very interesting, it does go into a lot of details and may be hard to digest the first time around."
        ],
        "Rating": "5"
    },
    {
        "Title": "Tarot Psychology Book: Volume I of the Jungian Tarot Trilogy (Paperback or Softb",
        "Price": "$13.54",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Great book to understand the symbolism of the Tarot trough Juanguian Psycology and be clear about the meaning of the paintings of Junguian Tarot."
        ],
        "Rating": "5"
    },
    {
        "Title": "Many Lives, Many Masters: The True Story of a Prominent Psychiatrist, His - GOOD",
        "Price": "$3.76",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I had actually read this book, much more than once! Every time I purchase it, I read it, and I recommend it to a friend or a family member. I let them borrow it, and I never see the book again.... So what do I do? I keep buying new copies.\n\nThe best way, to summarize and review this piece of literature is to simply say, THIS BOOK CHANGED MY LIFE. In so many ways, and much more then I can actually sum up in 5000 words, but I will try... It made me reaffirm my belief in GOD, it made me realize that you must stay true to yourself no matter what, and it made me learn that life is worth living, and to never give up on your dreams... It also thought me and reaffirmed, yet again, that things are meant to happen and they happen for a reason. But above all that, Love is all, and in the end it willall work out the way it should have to begin with.\n\nThe book will not be the great big piece of literature of the century by the way its written, and I don't think that's the intention here. It is about a journey, and the message it caries. I almost guarantee, that you will be able to find something in this work that speaks to you and I truly believe a little bit of \"....what da' f****?\" reaction will be coming from you as you read. Its short and I've read it in one sitting no problem. You will want to follow this read with \"Only Love Is Real\" once you are finished.....Read full review",
            "In reading this book one need's only to have an open mind as the author now does despite his scientific root's. We know not the wonder's life has after we leave this life. A close family member has had the same experiences as the patient in this book and I never doubted his sincerity to his event's. This book was suggested to me by my 30 year old daughter, raised in a Christian home, but never fully accepting the Christian life, only to go out in the world thinking there is a higher state of being most human's are looking for. So compelling the book is I read it in 2 day's time. Wonderfully written and not boring waiting for a climax at the end. It is what it is! life's experience.",
            "This is a truly inspirational book. Taking into account that it is a true story, I would say it's remarkably impressive. This is the perfect book aimed to turn upside down your beliefs about life and death. It's written by a scientist and the  man behind him, but also by his uncommon patient and a universal wisdom canalized through her (the masters). In my personal case, I should say I have believed in the Rosicrucian theory of reincarnation for quite a while now. When I read certain passages of the book it felt like I was listening to a friend of mine who's a higher-order rosicrucian. However, like Dr. Weiss himself admits, before meeting Catherine he had never read anything related to parapsychology or reincarnation. According to his words, his mind was too analytical and scientific to focus on something he considered to be open to speculation. Even having the proofs before his eyes, he still doubted his own senses for some time. I definitely recommend this book to anyone who seeks enlightment, spiritual peace or just wonders about whats beyond this world. Beware, narrow minds, this book will surely shock you. People interested in reincarnation-related studies, take a look at Dr. Ian Stevenson's work. And remember that the ultimate source of higher knowledge lies nowhere but within ourselves. God bless you all.Read full review",
            "anyone who lost a loved one, or have questions regarding the afterlife, or life in general, this book is great. It contains many points that reflect a true spiritual event. it helps us understand that we are not just this one birth, we are of many lives. This book helps you stick your head a little higher to see the world around you, it is great for someone who is spiritual and wants to know more. Great book, short but very nice to read. We are all filled with mysteries, sometimes we dont know why we fear or like something, maybe its something from a previous birth? Entertaining and vivid, great book and a great author.",
            "I am an open-minded person who recently lost my son. His passing sent me into a deep depression. I have been reading a number of books to help me accept his passing and go on living. This book is at my number one spot for just that purpose.  Written by a doctor with more than excellent credentials, it helped me understand our purpose in life. I could not put this book down. Easy to read, easy to understand. No confusing medical terminology. I just bought two more copies to give to other family memebers. I plan to read the other books written by Dr Weiss. My next one, Messages from the Masters, was also bought on ebay. Absolutely would highly recommend this book!"
        ],
        "Rating": "5"
    },
    {
        "Title": "New ListingERUPTION Michael Crichton & James Patterson  Hardcover",
        "Price": "$18.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Brand new book, can’t wait to start reading."
        ],
        "Rating": "5"
    },
    {
        "Title": "Home Again: A Novel - Paperback By Hannah, Kristin - GOOD",
        "Price": "$3.96",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Another great find…. Will order more by this Author!",
            "Pretty good love story",
            "As described."
        ],
        "Rating": "5"
    },
    {
        "Title": "C. G. Jung Synchronicity (Paperback) Bollingen Series",
        "Price": "$12.22",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Insightful and describes very well where Jung was coming from."
        ],
        "Rating": "5"
    },
    {
        "Title": "Mrs. Dalloway - Paperback By Woolf, Virginia - GOOD",
        "Price": "$3.78",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I thought I'd missed out on this author from the early 20th century.  I was wrong.  Her writing has little plot, less character development and, although I usually grin and bear it, when I'm not in love with a book, I gave us before reaching half way.\r\n\r\nModern writers outshine most of the 19th and 20th century guys and girls by far.",
            "Described as \"very good\"; yet it has considerable written comments and underlinings.",
            "Woolf is at her best here.  Each character fully realized.",
            "Great book",
            "The cover they sent was not the cover on this listing, which is annoying as that's why I bought this edition."
        ],
        "Rating": "3"
    },
    {
        "Title": "The Myth of Normal : Trauma Illness & Healing in a Toxic Culture - Dr Gabor Mate",
        "Price": "$13.98",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Whole-Brain Child: 12 Revolutionary Strategies to Nurture Your Child' - GOOD",
        "Price": "$6.28",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This book stresses the importance of staying in close contact with your child so you will know when to take the opportunity to listen with your heart and then be able to gently lead them into their logical reasoning. Throughout the years of child rearing and teaching I have read many books on the brain.  This one is very practical offering strategies that can really work",
            "IF YOUR STRUGGLING  AND YOU WANT TO DO THE BEST FOR YOUR CHILD(REN) ...YOU WANT THIS BOOK. IT HAS BEEN MORE HELPFUL THAN ANYTHING I HAVE READ THUS FAR AND I HAVE READ PLENTY. EASY TO UNDERSTAND AND APPLY TO DAILY LIVING. GREAT HELP FOR YOU AND YOUR CHILD! I RECOMMEND THIS FOR TEACHERS AS WELL!",
            "The book came practically brand new. I love the content so far.",
            "Great book st a great price!!!",
            "This book is in good shape. It is very useful information and I am glad I purchased it."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Happiness Advantage: How a Positive Brain Fuels Success in Work a - GOOD",
        "Price": "$4.55",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "A little worn in the bottom right hand corner",
            "All fantastic"
        ],
        "Rating": "4"
    },
    {
        "Title": "Children with Emerald Eyes : Histories of Extraordinary Boys and Girls by...",
        "Price": "$9.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Mira Rothenberg mesmerizes the reader with histories of autistic clients.  Their stories made me weep; sob more accurately.  I have a strong need to discover what eventually became of each and every one.  Reading their stories provided me with greater insight into the needs and experiences of my autistic grandson. As a result my determination to help him has grown even stronger.  This book is a must read for anyone who works with children who have special needs. ...cvc",
            "A very interesting book I read a long time ago.Still very relevant for medical or lay person to read. Fascinating."
        ],
        "Rating": "5"
    },
    {
        "Title": "Option B : Facing Adversity, Building Resilience, and Finding Joy by Adam. Grant",
        "Price": "$3.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "I became a widow 9/1/17. He was my high school sweetheart. We married after dating for 4 years. Just after celebrating our 26th anniversary, my husband was diagnosed with stage IV Lung Cancer. 1 year and 4 days later he died. He was 48 & never smoked. While reading Option B, I found myself connected to those who have lost a spouse. For the first time in a long time, I didn’t feel alone. Thank you so much for sharing .",
            "I lost my husband and my father just 3 weeks apart a year ago. Even though I’ve gone to grief counseling, I still felt like I was losing my mind and my grip on life. This book helped me understand that all of the things I’ve been feeling and doing are perfectly normal for someone who is deeply grieving. It’s given me the hope that one day I will feel “normal” again.",
            "My sweet PattySue went to be with Jesus 2 years ago. I feel such a lost even now I cannot describe it. But I do know that as Christians we will be reunited when I am no longer among the living here on earth only because we love and believe in Jesus. I will see her again. I will talk with her and hold her sweet hand again. The author of this book is Jewish and says she will never see her husband or talk to him again. This is true because  only Jesus believers make it to heaven.  This is not being judgmental. This is taught in the Bible. Don't wait as a couple to get right with God. Do it now so you will see and touch again in heaven.",
            "Most of the content is very helpful. As with anything, I disagree with a couple of things the author says. Got a good price on the hardback. Shipping was a little slow.",
            "Beautiful book I’ve just started reading.  Having experienced loss myself, Sheryl has opened my eyes to moving forward when it seemed impossible.  Option B is a heartfelt book that all should read because everyone will experience a loss of some kind in their lifetime.  Thank you Sheryl for sharing your thoughts with all of us.  It has helped me tremendously."
        ],
        "Rating": "5"
    },
    {
        "Title": "Shop on eBay",
        "Price": "$20.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Shop on eBay",
        "Price": "$20.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Children with Emerald Eyes : Histories of Extraordinary Boys and Girls by...",
        "Price": "$9.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Mira Rothenberg mesmerizes the reader with histories of autistic clients.  Their stories made me weep; sob more accurately.  I have a strong need to discover what eventually became of each and every one.  Reading their stories provided me with greater insight into the needs and experiences of my autistic grandson. As a result my determination to help him has grown even stronger.  This book is a must read for anyone who works with children who have special needs. ...cvc",
            "A very interesting book I read a long time ago.Still very relevant for medical or lay person to read. Fascinating."
        ],
        "Rating": "5"
    },
    {
        "Title": "Trauma Through a Child's Eyes : Awakening the Ordinary Miracle of Healing",
        "Price": "$9.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "This book is a real contribution in the study of trauma. It would be to everyone's advantage, especially parents and teachers', to get familiar with these issues. It will give you the essential knowledge you need in order to understand and help children in a more loving and efficient way. There is no way that a sensitive reader can have the same attitude towards children, after reading this book.",
            "This book has many research based facts and guidelines on how to help children, ourselves, and even strangers overcome and get through trauma. It does an excellent job at holding interest and brings up creative strategies to teach how to deal with the effects of trauma. I believe it is a book every parent and child care provider should read!"
        ],
        "Rating": "5"
    },
    {
        "Title": "Trauma and Memory: Brain and Body in a Search for the Living Past",
        "Price": "$9.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "I am one of the people that this book describes. It has been so refreshing to read!",
            "The book is as advertised. In great condition and a great resource!"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Stillwater Girls by Minka Kent (2019, Trade Paperback)",
        "Price": "$7.08",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "great book",
            "Fast and fabulous"
        ],
        "Rating": "4"
    },
    {
        "Title": "Thinking, Fast and Slow - Hardcover By Kahneman, Daniel - GOOD",
        "Price": "$8.90",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Brilliant author bridges part of the gap between psychology and economics.",
            "Awesome book in great condition!",
            "Highly recommended A+"
        ],
        "Rating": "5"
    },
    {
        "Title": "A Clockwork Orange - Paperback By Burgess, Anthony - GOOD",
        "Price": "$5.90",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This book is a great read. It gives one closure with the 21st chapter that the movie didn't show. The language is eloquent, sexy, and raunchy. Interesting combination, but true. It gives one perspective on mind control. Not for younger audiences.",
            "The language created by the author is a little difficult to follow at the beginning, but it becomes easier as you read. The novel is still relevant when one considers the technology available. It is compelling as society questions the viability of rehabilitating violent criminals.",
            "Only real complaint about the book is that it doesn't have a glossary for their language, like some versions of this book do. Other than that though, great book, and great condition as well!",
            "I first read this book on a whim in my 11th Grade AP English class. I immediately became hooked, and found it too fascinating to put down. I also had an interest in Psychology (which I now have my degree in), so reading about one particular \"malchick's\" experience with reinforcement was extremely interesting. \r\n\r\nThe thing that is the most amazing part about this book is the sheer LUNACY of the language presented. What's even more incredible is that by the end of the book, I assure you that you will begin to actually understand the fake language put forth, and would probably be able to speak it fluently-should you ever find yourself drinking some moloko with your droogs. \r\n\r\nBasically, READ THIS BOOK! Unless you're a completely sheltered and close-mided freak, youwill LOVE it! :)Read full review",
            "If you thought the movie was bad, wait till you read the book. \"your humble narrator Alex is ten times more disturbed in the book than he is in the movie. Some parts of the movie based on the book were really pushing the edge as to how sick Alex really is, but if they showed a true portrayal of the real Alex, theres no way they could put it on film, even in today's movie industry.\n\nWhat makes the book so great is that Alex is just a young kid (15 ears old) when it was him and his droogs. But throughout the whole book you get to see the slick and stylish Alex, that also happens to be extremely disturbed. In the book he doesnt brag about the things he does, he makes it out like (and to him it is) a sort of every day thing to rape,molest,murder and steel. He is basically just telling his stories  from the youth perspective that he is. But there is no doubt he is A very disturbing, very sadistic character.\n\nAlso, in this book, it includes the last chapter which was left out in the movie, which is a nice bonus.\n\nIts also fun to see the differences between the book and the movie, but the book takes the cake in my opinion.\n\nJust know there is a lot of old english slang which can be hard for the american reader to fallowRead full review"
        ],
        "Rating": "5"
    },
    {
        "Title": "Mind Magic by James R. Doty MD",
        "Price": "$5.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Their Eyes Were Watching God: A Novel - Paperback By Hurston, Zora Neale - GOOD",
        "Price": "$4.18",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I found the dialect difficult to follow. Jamie’s story was interesting. As a northerner, I never experienced many of the prejudices depicted in the book was so ashamed that they not only existed but were applied to anyone with black skin regardless. I liked the tight bonds developed between the characters.",
            "It was all used and there was writing on it. But thats okay. It was still great and perfect for me because i only bought it for my school.",
            "Very good price ! The book looks NEW ! All pages clear and no writing",
            "I read the book for a women's lit class I am taking. It is well-written with a compelling plot. At times the dialect is difficult to plow through, but it didn't really affect my enjoyment of the book.",
            "The story is very good.  The condition of the book wasn't.  There was an odor and notes written on the pages.  I overlook these things, as the price was good and I am able to enjoy the novel."
        ],
        "Rating": "3"
    },
    {
        "Title": "Without Merit: A Novel - Paperback By Hoover, Colleen - GOOD",
        "Price": "$6.90",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This is a very good book as always",
            "Colleen Hoover never disappoints.  I believe that I have read all of her books and genuinely like them all.",
            "Great thank you",
            "Love it love it love it but I love any book Colleen writes"
        ],
        "Rating": "5"
    },
    {
        "Title": "Why We Sleep: Unlocking the Power of Sleep and Dreams - Paperback - VERY GOOD",
        "Price": "$6.78",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This author knows what he is talking about. This book is hard to put down. Greatly increasing my understanding of sleep. Well worth even a second read.",
            "A couple of criticisms:  1. Walker could have said it all in half as many words. 2. I was hoping to get information that would help me to sleep better.  Walker says nothing here about the impact of reproductive hormones, diet, pain or the phenomena of TV's ability to put you to sleep.  I did not need to be convinced that getting enough sleep is important.  But he does make that argument forcefully.  Borrow it from your library.",
            "Still in the midst of reading it, but hope it helps with my sleeping problems.\nOne disappointment: I inadvertently ordered the eBook version, whereas I wanted the paperback.\nIt was my oversight, so I am coping with the inconvenience.",
            "Very good content.  Sleep is such an important commodity in our busy lives.  Take the time to really read and value the content.",
            "Again, technical medically but great info.  Too many people that suffer sleeping.  Makes a lot of sense and simple to try.  Good warnings for those stuck on sleeping meds.  So scary what we let doctors lead us to believe is safe and good.  Need more people to challenge AMA and other levels of corruption in our country and broken health care system."
        ],
        "Rating": "5"
    },
    {
        "Title": "usa stock The Psychology of Money+ Atomic Habit+ compound effect 3 book in combo",
        "Price": "$21.00",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Attached: The New Science of Adult Attachment and How It Can Help YouFind - GOOD",
        "Price": "$6.98",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Book a little stained but still great",
            "I ordered this book because Levine was described as an authority on attachment theory in the Boston Globe.   I thought I was getting a book about the clinical concept, but instead it is dumbed down and, in what is obviously a marketing ploy,  focused solely on love relationships and how the layperson can diagnose oneself and ones partner and apply the theory to fix everything.   \n\nIt's good and honest that the authors do not take full credit for developing the whole clinical theory, but their bibliography fails to list a single article let alone foundational text by the guy they credit as the \"Father of Attachment Theory.\"   That's really sloppy, and throws suspicion on the quality of the rest of their work.",
            "An excellent source for understanding those you love who have attachment issues.",
            "It has changed the way I look at the world. very helpful.",
            "I had already read this when I bought it. I feel it is a worthwhile addition to my library - a reference to remind me of important information."
        ],
        "Rating": "5"
    },
    {
        "Title": "Silence of Adam : Becoming Men of Courage in a World of Chaos by Al Andrews, Don",
        "Price": "$4.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Overcoming Trauma through Yoga: Reclaiming Your Body - Paperback",
        "Price": "$9.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [],
        "Rating": null
    },
    {
        "Title": "Combo book set of Same as Ever Rich Dad Psychology of money & Atomic Habits",
        "Price": "$39.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "(Set Of 3 Books) Atomic Habits+ikigai+the Psychology Of Money Paperback",
        "Price": "$23.29",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Atomic Habits: Tiny Changes, Remarkable Results - Hardcover - GOOD",
        "Price": "$12.80",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I found it to be very useful in learning to break goals down into smaller pieces so you can accomplish them -- without feeling overwhelmed.  I also bought the online version so I can read when I'm waiting for appointments. But I found that I preferred the hard cover copy so I can write notes and go back and forth easily. I have ADD, so this is one of the first books I've found easy to follow.",
            "I just received this book & I've only had a chance to read a few pages.  My granddaughter, daughter-in-law & therapist friend highly recommended this book.  What I heard from them & what I have read; it is clear that this book is an instrumental tool to break old habits & move forward with new ones.  Based on what I know so far, I recommend this book!  Wishing you good mental health!",
            "Awesome book - admittedly only part way through. Any book like this that provides a good long look at how our brains work should be read by anyone who wants to become better. And that's what it's about. Real, practical insight on understanding yourself, and making becoming who you want to be. Very solid and well written.",
            "This grabs interest right away and makes some very valid points and suggestions. I am not finished reading it yet but really recommend it. I am glad it was recommended to me and I bought it.",
            "Gives examples how to implement the various suggestions for improving your life.\n\nPractical simple thoughts that make sense."
        ],
        "Rating": "5"
    },
    {
        "Title": "3 Book Collection Set (big) Power+ Atomic Habits and Psychology of Money PB",
        "Price": "$22.00",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Maybe Now: A Novel (3) (Maybe Someday) - Paperback By Hoover, Colleen - GOOD",
        "Price": "$6.54",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I have just been introduced to this author recently and so far all of the books I have read by her I have really liked. I suggest if it is part of a series to read them in order as it is easier to stay within the story line. Very good book!",
            "Great book at a great price",
            "good book I love all of her books",
            "As expected thanks",
            "Perfect thank you so much"
        ],
        "Rating": "5"
    },
    {
        "Title": "Psychology 2e by OpenStax (hardcover version, full color) - Hardcover - GOOD",
        "Price": "$20.83",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "**CAN 'T HURT ME & NEVER FINISHED BEST SELLING 2  BOOK SET  BY DAVID GOGGINS....",
        "Price": "$22.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Rules of Civility: A Novel - Paperback By Towles, Amor - GOOD",
        "Price": "$5.75",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I recently read A GENTLEMAN IN MOSCOW by Amor Towles. I was given to me by a friend, and I had doubts whether I would like it. I loved it so much I got on Ebay to see if they had a used copy of the paperback for sale. It was at a good price, and I received it sooner than was expected. RULES OF CIVILITY, the first book by the author, does not disappoint! Amor Towles is an excellent writer. The characters are well developed, the period is well represented.",
            "Most of the novel was involved in describing with rapturous delight the material wonders of life in the NY upper social crust.  The main character was not very interesting, never very well described, and not in the least bit sympathetic.  The dialogue was way too clever and unnatural - everyone had a great quip and a quick comeback.  There was also no \"soul\" there.  While it could have been a contrast between values of the rich and the poor, it was not - the poor were just wanting and the rich just socialized ... except for one who went off to fight in a war.",
            "Amor Towles has a unique talent, seldom seen in your typical novelist. His insightful descriptions, his select choice of words, and his complex plot lines are truly a refreshing joy. I wholeheartedly recommend this book, along with “Gentleman in Moscow”. Looking forward to reading his new “Lincoln Highway”!￼",
            "Book is good used shape. Looking forward to reading this book.",
            "Good read, I am just getting into it!  A young woman from the Midwest comes to New York in the late 1930s, looking for success and a possible love relationship. Aided by women of diverse ages and experience, she eventually gets involved with an older man who teaches her \"the rules of civility.\""
        ],
        "Rating": "5"
    },
    {
        "Title": "Feeling Good: The New Mood Therapy - Mass Market Paperback - GOOD",
        "Price": "$4.27",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "David Burns explains why you feel anxious and angry in this book and How to deal with your uncontrollable feelings of anxiety and panic. He uses simple examples and tricks to help you learn to control your emotions. Highly recommended for anyone who experiences panic attacks and anxiety.",
            "This was recommended by my therapy group. \nI prefer a larger format and font. It's 20 years old and needs revamping. Edit heavily, make it 8\"x10\". Wordy stories of John and Marsha and what they should have said and thought.",
            "The book outlines techniques for recognizing problems of depression and then changing thought processes to deal with anxiety, panic, low self-esteem, guilt, etc.  The author describes techniques of cognitive therapy to deal with many problems associated with depression without the use of drugs.  In recognition of depressed people possibly needing antidepressant medications, he has an updated guide for consumers on antidepressant drugs which is very useful in learning about possible drug actions and side effects.  I bought this book because it was recommended by a psychologist for working on depression and related problems.  It contains self-tests and scoring for analyzing situations and behaviors that can result in or be caused by distorted thinking,  It also teaches the reader how to recognize distorted thoughts and figure out ways to change that way of thinking to more realistic and positive thoughts.  It is a very good book and Burns writes in an unpretentious and understandable style.  Compared to other self-help books of this nature, it is much more detailed and has very helpful exercises, tables and charts.  I would recommend it to anyone who wants to help themselves out of a depressed mood and possibly change behaviors to remain in a better mood without drugs.Read full review",
            "A 700-page book for $4 is quite a good deal, especially such an important book. The text was a lot smaller than I'm used to reading, but it's expected of physical books from the 20th century. (I usually read on my Kindle.)",
            "Excellent book.  Cured my depression and anxiety.  Whenever I feel a  bit down, I pull it off the shelf and reread to help myself again.  I wore out my first 2 copies, so I bought 2 more on ebay.  Thanks!!"
        ],
        "Rating": "5"
    },
    {
        "Title": "Daisy Darker: A Novel - Hardcover By Feeney, Alice - GOOD",
        "Price": "$5.57",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Very good 👍 👏 👌  I'm happy with this purchase 😊"
        ],
        "Rating": "5"
    },
    {
        "Title": "Their Eyes Were Watching God - Paperback By Hurston, Zora Neale - GOOD",
        "Price": "$4.18",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Some books you read and forget about. Some you treasure and keep on your shelves. Some you put in a special category, and love them forever, and read them over again and again. Their Eyes Were Watching God is in that best category of love forever. A feminist slant in a time when black women writers were not given much attention. Lyrical writing that makes your heart sing at its profound beauty. A love story that teaches what love means when you finally have what you are looking for.",
            "She has a way of conveying in-depth ideas in short dialogue.....I hated to finish the book...I wanted more",
            "It is a good book but hard to read",
            "Great book",
            "It is a used book but in good condition, arrived on time and it's a good price. Thank you!"
        ],
        "Rating": "5"
    },
    {
        "Title": "Adult Children of Emotionally Immature Parents: How to Heal from Distant, - GOOD",
        "Price": "$8.84",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Very grateful for this book as it gives me alot of validation that I am not alone with what I have experienced throughout my 34 years of life, growing up with emotionally immature parents and family members.\n\n Alot of self-realization and self-actualization that I have been going through these last 10 years during and after college is very parallel with what the author speaks about in her book.\n\n Highly recommend for anyone who struggles with self-identity and lack of self-esteem and confidence due to being neglected emotionally by self-centered parents.",
            "This book has been extremely helpful. I actually found myself described too a tee. Planning to read it a second time to be sure I got everything that's there for me. Many thanks to the author.",
            "This book changed the way I viewed a lot of things about my own life. It is so well-written, easy to follow and informative. One of my best book purchases yet.",
            "3 chapters away from finishing this book and it has been so validating. I’ve highlighted so much of this book as it has described my family and my childhood so well it is as if someone wrote the book specifically for me. To me this means that this is something many people experience and therefore anyone who has any interest in understanding themselves & family should read it. \nThis book is a great gateway into understanding childhood trauma and can lead you into healing and understanding as well as more research into why you are who you are and how to grow from this information.",
            "My freaking childhood -- seriously.\n\nDid you, also, have to parent your own parents?  Read about internalizers, externalizers, and the roles many of us born to immature adults were forced to play.\n\nCompelling.\n\nFascinating.\n\nSuperb read -- I keep a copy on hand at almost all times. (Seriously.)"
        ],
        "Rating": "5"
    },
    {
        "Title": "2 Weeks To A Younger Brain: An Innovative Program for a Better Memory and - GOOD",
        "Price": "$4.46",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Informative and easy to read!",
            "happy thanks",
            "Easy to follow"
        ],
        "Rating": "5"
    },
    {
        "Title": "Eruption : Following Jurassic Park, Michael Crichton Started Another...",
        "Price": "$19.10",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Brand new book, can’t wait to start reading."
        ],
        "Rating": "5"
    },
    {
        "Title": "Combo book set of Same as Ever Rich Dad Psychology of money New Stock Fast Shipp",
        "Price": "$29.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Team of Rivals : The Political Genius of Abraham Lincoln by Doris Kearns Goodwin",
        "Price": "$4.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "The author, Doris Kerns Goodwin knows her stuff, well resarched book, a great historical story. The best book of 2021 that I really enjoyed! Love it!",
            "Team of Rivals by Doris Kearns Goodwin (2006)\r\nIn 1860, in Chicago, Illinois, the Republican Party made a historic choice when it selected Abraham Lincoln to be its candidate for the presidency. The choice stunned each of Lincoln's three rival candidates--William Henry Seward of New York; Salmon P. Chase of Ohio; and Edward Bates of Missouri--all of whom were better known nationally and better connected politically--and each of whom thought he himself would win. Even more surprising, but indicative of his character, is that Lincoln asked these three rivals to join his cabinet, which they did--and they made it work. In a rich historical narrative, Doris Kearns Goodwin brings to life each of these figures, showing their significant individual contributions as well as how they challengedthe president and sometimes stung him. What comes across is a deep psychological portrait of Lincoln as a great conciliator and man of vision, always putting the greater good before expediency. And while much has been made of Lincoln's melancholy, it is also true that he was good in company, a born storyteller and jokester. Lincoln is perhaps the most written-about president in history, but in this group biography, Goodwin manages to find some new perspectives on Lincoln and his times. A New York Times Notable Book for the year 2005.Read full review",
            "Goodwin's Lincoln biography, Team of Rivals, shows the power of synergy.  They synthesis of diverse viewpoints always results in higher thinking and better results than unilateral thinking.  Having taught Covey's \"Seven Habits of Highly Effective People\" for many years in several organizations, I know this is true.  Plus, Obama has obviously been influenced by Lincoln's approach to building his cabinet and I wanted to read the book I know had inspired our president elect, a man I most admire!  Finally, my daughter who was an American Studies major in college, now an attorney, highly recommended it as a masterpiece of biographical writing -- it reads like a novel, telling many interwoven stories of statesmen and others during the critical time of American history.",
            "\"Team of Rivals\" is a page-turner.  It is a parallel biography of Abraham Lincoln's evolution as a politician and of the men he selected to his cabinet in his first term.  As a management study, it provides the reader with an example of executive excellence under stress.  It is a study in the ethical use of politics for the good of an organization.  Finally, it clearly shows the brilliance of our 14th president in a clear, cohesive, chronological manner.\r\n\r\nAlthough it reads like a dramatic novel, this book is among the top level of 'Lincolnography'.  It's current relevance as a \"how-to\" manual for the Obama administration makes it a 'must read' for the serious political observer as well as studens of Lincoln.",
            "This book is about President Lincoln`s political rivals who went on to be his Civil War era cabinet. All of these men worked-well during Lincoln`s tenure except Secretary of State Cameron.\r\nI believe author Doris Kearns Goodwin did a excellent job with is 800-plus page book. There are some pictures that accompany this book."
        ],
        "Rating": "5"
    },
    {
        "Title": "Waking the Tiger: Healing Trauma",
        "Price": "$9.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "I purchased this book because it was referenced so many times in other materials I was reading to help myself along my journey of healing from childhood sexual abuse.  This book really helped me to think outside the box of the same old hum drum therapy procedures.  Levine helped me to understand many unique things about trauma, which I am using to find my way out of the dark.  \r\nHave you ever seen a deer with PTSD symptoms after it barely escaped being hit by your car?  How about a cow suffering from nightmares after it's leg was trapped for 8 hours in its stall?  Levine has an intriguing theory about what happens to human survivors of trauma and why we struggle with challenging after effects when our animal friends do not.  He discusses at length how the trauma effects (like the symptomsof PTSD) stay with us because we haven't been able to expel the negative energy from the trauma experience.  If we were unable to respond to the traumatic experience by either fight or flight, we most naturally froze in the face of the danger; hence, trapping that fear energy deep within our souls.  This book shares many techniques on how to release that negative energy in order to help one feel free of the PTSD and other after effects of the traumatic experience one lived through.\r\nIf you like thinking outside the box and reaching for something that connects therapeutic philosophies to our connection to the animal kingdom, then I highly recomend this book.Read full review",
            "It's a self help book and it was a gift.  The book guides the user through a process of self healing.  It's way to soon to determine if it's recommendable, of good value or compelling.",
            "It’s great to realize that something can be done to deal with trauma and especially something you can practice every day!  Not easy though!!",
            "this was written in 1997- get his book  'in an unspoken voice' written in 2010-\nthe latter is a complete copy(verbatim) of the book written in 1997 PLUS diagrams and some updated language.",
            "I've read thousands of books and articles; this is best book I have ever read. It is a work of absolute genius."
        ],
        "Rating": "5"
    },
    {
        "Title": "Get Out of My Head : Inspiration for Overthinkers in an Anxious World by...",
        "Price": "$9.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "*Atomic Habits* by James Clear Build Good Habits & Break Bad Ones (Paperback)",
        "Price": "$10.12",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Night She Disappeared: A Novel - Paperback By Jewell, Lisa - GOOD",
        "Price": "$4.77",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "All of her books are very well written, and she has one of my favorite authors. I’m currently not done with this book but it is leaving me spellbound.",
            "Great deals."
        ],
        "Rating": "5"
    },
    {
        "Title": "You Are Psychic: 7 Steps to Discover Your Own Psychic Abilities by Char Margolis",
        "Price": "$13.18",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Idiot: A Novel - Paperback By Batuman, Elif - GOOD",
        "Price": "$5.62",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "An Unquiet Mind: A Memoir of Moods and Madness - Paperback - GOOD",
        "Price": "$3.68",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This book has taught me so much about manic-depressive illness.  This author is exquisite . Reading this is a welcome respite from the run- of- the- mill content you find in books that have been watered down for the mass market.",
            "Very well written. The issue I had with it is that the book seemed more like a sales pitch for Lithium. I've been on Lithium, nearly killed me, I'd say it's one of the most dangerous drugs I've been on with more serious side effects. Her life is interesting, it is worth the read, if you look over the cheerleading for Lithium. A real memoir on Bipolar disorder to read is Manic by Terri Cheney, that one I'd recommend. Unsure if I'd recommend this one, all I can say it's interesting, wouldn't ever read it again though.",
            "I bought it because my therapist suggested that I read it.  I have depressive disorder, not bipolar, but I actually read it for guidance about writing professionally about a topic that one has a personal connection to.  The story is harrowing, but the writer doesn't indulge in melodrama, and every story is told in the simplest way possible.  It also manages to demonstrate that the FOX NEWS-type idea of \"objectivity\" is something of a myth, because we all bring our personal connections that drove us toward that particular area of interest.  What she does show it a that it is possible to overcome one's subjective predispositions by becoming aware of them.  She also demonstrates that mental illness is a disease like any other in that it should not make us automatically feel that their decision-making and evaluative judgments cannot be trusted; like anything else, it's a matter of degree.Read full review",
            "Recommend this book to everyone that has family or friends with mental health issues.  Understanding is key.  Congrats to the author for her candid disclosure.",
            "I’ve just started reading this book but it was recommended to me by my psychiatrist.  This author suffered from this disorder and her experiences were written by someone who has a first hand experience with bi-polar."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Housemaid - Paperback By McFadden, Freida - GOOD",
        "Price": "$7.15",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "For readers who love Rendell and/or Highsmith, Freida McFadden is a very welcome and admirable newer voice.  I have now read 4 of her thrillers, and plan to collect the others soon.  She pulls the reader in with the first paragraphs, and it's hard to put the book down after that!  I stayed up until 3 AM to finish a couple of Freida's books and that's not my typical schedule!  Psychological mysteries with unexpected plot twists are this author's specialty, and in this she is a modern master.  Highest possible recommendation!",
            "I couldn't put it down. Can;t wait to finish it. Will definitely read more books by this author.",
            "Seller and book delivered were fine, a bit slow. Story read as a quick entertainment, fast food,  low plausibility of belief in plot, but a greasy dish for book club chatter.",
            "This is a great author.... it was a very good read",
            "Books are a personal choice. I haven't read this one yet, as I am finishing up a different novel at the moment."
        ],
        "Rating": "5"
    },
    {
        "Title": "Mind and Body : Mental Exercises for Physical Wellbeing",
        "Price": "$9.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Drinking : A Love Story by Caroline Knapp (1996, Hardcover)",
        "Price": "$4.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "I bought this to replace a book I lost—& honestly, this copy is in much better shape than the last one. MANY THANKS! It’s a great read also. It bears repetition.",
            "I chose the book because I happened to come upon the book, \"Two of a Kind\" by Caroline Knapp.  Reading the inside cover, I learned that she had a drinking problem and I decided to look for the book, \"Drinking: A Love Story.\"\n\nI love the way Caroline writes as well as her honesty in the book.  I didn't realize that so many people in my life had the disease of alcoholism or its \"isms.\"\n\nI decided to do a search on Caroline and I was saddened to learn that Caroline passed away.   I felt angry as well as she had gone through so much as well as beating this disease.  I felt Caroline was jipped out of a life of sobriety.",
            "This is not a self help book....it is a moving story about one person's struggle with alchohol. Even if you don't drink, this is a great read.",
            "Perfect condition",
            "Very amazing story. Hits a nerve or two."
        ],
        "Rating": "5"
    },
    {
        "Title": "Radical Acceptance: Embracing Your Life With the Heart of a Buddha - GOOD",
        "Price": "$7.59",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This was a book recommended for a \"Mindfulness\" Group. This book is very enlightening and informative. I purchased a copy for a friend as a gift. I wish I knew of this book a long time ago.",
            "The book is clearly written by an experienced and knowledgeable author and therapist and gives readers valuable tools for overcoming life's traumas and difficulties.",
            "Have not finished reading the book but so far I am very impressed and find it interesting, informative and engaging.  I recommend it",
            "One of the top rated mindfulness features",
            "I’ve been bullied all my life.   I was told horrible things.  I’m loving this book"
        ],
        "Rating": "5"
    },
    {
        "Title": "Women Who Run with the Wolves:  Myths and Stories of the Wild Woman Ar - GOOD",
        "Price": "$5.84",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "...this is a great addition to any library! Wonderful, rich stories woven by a true storyteller re: female archetypes. This is a book that creates true contemplation re: what the storyteller said, what symbolism is there, how does this apply in our culture and/or our lives directly. Every once in a while, the author suggests something that doesn't entirely resonate with me (so, I just let that part go), but overall quite pleased this was recommended to me!",
            "The book created a good spirit and overall content to reader; however I feel no interesting of reading the cycling to nowhere. This book should be more suitable for particular type of reader.",
            "I echo the sentiments in the other reviews about the many ways this book has value in our lives.  This is a work of deep intellectual and spiritual importance not only for women, but for the rare men who seek to understand women in a deeply philosophical and conceptual way.  This book occupied my nightstand for easy reference and then I foolishly loaned it never to see it again.  It has been replaced and I missed it while it wasn't here.  This is one of those books that one doesn't loan, but rather buys copies of for others.  Ms. Estes has compiled an extraordinary collection of myths about female archetypes that, when seen though her eyes, all have bearing on our lives at different times and in myriad experiences that can become road/life maps and serve as models as well.  A brilliant book by a brilliant author.Read full review",
            "This is the absolute BEST book I have ever read in 40 years!  It is my Bible,  I have been reading it for 10 years now and constantly refer to it's pages for comfort in bad times and good.  I frequently  purchase this book to give away to women everywhere.  THE author,  Clarissa Pinkola Estes is an absolute marvel at storytelling, pyschology and simply explaining why we wonder, suffer, question,  become angry,  cry...why we love, hate, rage or enjoy.  It is NOT dry text pyschology but a joyful compilation of wonderful, incredible stories about life and love.  I have not gone anywhere in the last ten years without Clarissa or without acquiring a copy of this book.  I recommend you read any work of Clarissa Pinkola ESTES in book form or on tape.",
            "After 20 years in an abusive marriage at the age of 37 I, was given this book which helped me to change my life for the better, forever! Now at the age of 44, I also refer back to this book, which by the way is on the bed stand right next to my bed. I have also given it as a gift to many a young an old special women in my life in hopes of helping them to also make some changes or just to answer so many questions they may have about themselves or just life. This book is so well written and the stories are so real and fun to read over and over again, untill your able to tell some yourself to others. I took call it my \"Womens Bible\" Spiritual without all the religion...."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Psychology of Winning: Ten Qualities of a Total Winner - GOOD",
        "Price": "$4.08",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Good book, good observations, book a little dated but still relevant to today. Good read for car r plane journey",
            "Very nice book and easy to understand. Mr. Dennis Waitley bring out the best in me. This is nota motivational book but a practical understanding and approach to life. It is all in one's state of mind: \" If you think you can't, you can't, if you think you'll fail, you'll fail, If you think you;ll win, You will win! It's that simple principle one has to remember in every endeavor. I highly recommend this book to anyone.",
            "Awesome Book - Simply winning no time to lose",
            "The Psychology of winning is an amazing book, and I can't believe how fast this book has changed my life. I must admit, without this book i would have been in the same position 26 years ago. This is the best book i have ever purchased, and guess what? it cost only 99 cent. oh wow!",
            "Great"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Stranger - Paperback By Albert Camus - ACCEPTABLE",
        "Price": "$4.73",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "The book is in pristine condition and has no seeable blemishes save a few bent pages. In full the book is exactly what I expected, and if it weren't for the different cover, I'd have been entirely happy with this purchase, although I can't say I bother. Camus is well worth the minor inconveniences, which- in honesty- are not important compared to the experience. I'd recommend it to anyone.",
            "This book is titled The Stranger and as you read you will understand more. The main character seems goes through life with little or no feeling or emotions. It appears that he is like a robot going through daily activities with not much excitement or interest. He feels that people live and people die it doesn't matter one way or the other. He has become  unfeeling as he goes through life and when he is drawn into a murder just by being in the wrong place at the wrong time the court tries to find him guilty because of his seemingly emotionless attitude. If you have gone through experiences in your own life and felt out of control or didn't know where to turn, etc. you may relate to the main character and how he has portrayed in this book.\r\nThis is an easy read and has received great reviews when it was first published.Read full review",
            "Not completely finished with the book but it is interesting. I find the narrator quite funny.",
            "This is one of my top 5 books of all time and this particular translation is beautiful.  I buy every copy I can find just to give to my friends and my students.",
            "The book itself is in good shape but a previous owner wrote and underlined on almost every page, which I find very distracting. For the few dollars more I should of bought a new copy."
        ],
        "Rating": "4"
    },
    {
        "Title": "The Anxiety and Phobia Workbook - Paperback By Bourne PhD, Edmund - GOOD",
        "Price": "$4.18",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Excellent read to get started.",
            "Helped me to understand my anxiety and panic much better helps to learn to handle it I needed counseling also but the book was absolutely necessary",
            "I was looking for some new therapeutic ideas and this book really gave a lot of input and resources. I recommend this for counselors and therapists.",
            "My therapist wanted me to purchase this workbook for us to work through during part of our sessions, seems very helpful so far.",
            "Family member suffers mental problems always looking for self help information"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Wisdom of Insecurity: A Message for an Age of Anxiety - Paperback - GOOD",
        "Price": "$5.93",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Interior was littered with notes from previous owner(s). So much so, that many pages are difficult to read, even though the exterior of the book was in decent shape. Margin notes are not a problem but page after page of underlining, highlighting and write-overs make this a book that should have been retired long ago.",
            "WOI is an engagingly written work,so cleverly interspersed with wit and cool imagery that you forget that you are actually plunged into some of the murkiest corners of human consciousness.",
            "It helps out a lot ☺️",
            "Great view points",
            "Great insight"
        ],
        "Rating": "2"
    },
    {
        "Title": "Cant Hurt Me: Master Your Mind Defy the Odds by David Goggins, Paperback",
        "Price": "$11.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Trading Psychology 2.0: From Best Practices to Best Processes (English)",
        "Price": "$13.50",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "In a Dark, Dark Wood - Paperback By Ware, Ruth - GOOD",
        "Price": "$3.96",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "YOU. MUST. BUY. THIS. BOOK!!!  I happened to stumble across this book in the book store.  I have never read anything by this author before and thought I'd take a chance.  OMG.  GREAT READ!  I whipped through the pages because it was THAT good!  Easy reading and great writing style, but it was the storyline that had me flying through the pages.  A must read!",
            "This book surprises you with quite a few twists. A must read. I think I had too high expectations. But it was still good. You won't expect the ending.",
            "I love thriller book,which is why I bought it. Unfortunately, I just started reading it...but, I am enjoying it thus far!",
            "Didn’t realize it was an ex library book so it has stamps all over it. Other than that it was a good deal for the price.",
            "Still reading it but very good story."
        ],
        "Rating": "5"
    },
    {
        "Title": "Mindset: The New Psychology of Success - Hardcover By Dweck, Carol S. - GOOD",
        "Price": "$8.91",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Every teacher should read it!",
            "Because I need it for class.\nThere's nothing to dislike this book. I like the book very much .\nWell it all depends on the person the way they learned. I"
        ],
        "Rating": "5"
    },
    {
        "Title": "david goggins cant hurt me",
        "Price": "$9.70",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Think Again: The Power of Knowing What You Don't Know - Hardcover - GOOD",
        "Price": "$6.93",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Great book. Makes me think about thinking in a way that is engaging and effective. I am thoroughly enjoying this book.",
            "Awesome book!",
            "Very good book and learning material!",
            "satisfied"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Tuttle Twins and the Golden Rule - Paperback By Connor Boyack - GOOD",
        "Price": "$4.28",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This is a wonderful book for kids. I think kids should be learning how to treat one another at home and school",
            "This world needs a refresher in what it right and what is wrong."
        ],
        "Rating": "5"
    },
    {
        "Title": "Eileen: A Novel - Paperback By Moshfegh, Ottessa - GOOD",
        "Price": "$7.92",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "my daughter read it and enjoyed it. I have not read it yet.",
            "Perfect.",
            "Will read again!"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Psychology of Money by Morgan Housel 2020 Edition Paperback",
        "Price": "$10.80",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Doesn’t matter where we are on in our money game… we can always invest, so we can start by deciding or choosing to Today!",
            "The content is very compelling. It's a shame parts of it are almost unreadable for lack of proofreading.",
            "Great book - highlighted. probably 1/4 of it.  read it.",
            "Good insight into personnel finance on managing money",
            "A great book that everyone should read."
        ],
        "Rating": "5"
    },
    {
        "Title": "Mindset: The New Psychology of Success by Dweck, Carol S.",
        "Price": "$4.09",
        "Author": "by Dweck, Carol S. | PB | Good",
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Man's Search for Meaning - Paperback By Frankl, Viktor E. - GOOD",
        "Price": "$7.64",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I have read this book four tmes and each time I find it to be even more engaging and enlightening.  Thirty years ago I taught in a men's prison in Hawaii.  I passed around two copies of this book to my inmates.  It was so applicable to their situation.  This is the fifth time I have purchased this book because I lend it to friends and then they lend it to friends......  Well worth the purchase price which is very reasonable.",
            "I have wanted to read this book for years because I've heard so many good things about it, so I finally bought it and dove right into reading it. I was sorely disappointed, I ended up only getting half way through the book before I decided not to finish it. I didn't enjoy the way it was written.  I didn't feel like it flowed very well and I didn't enjoy the way the author told his story. It wasn't engaging or inspirational to me like \"The Hiding Place\" or \"The Choice\" were.",
            "Fantastic book about a psychiatrist who was in a concentration camp had to overcome pain and suffering (plus the chance of not surviving) and become a better and happier person.",
            "A deeply personal account of a tragic experience. He doesn’t give up or become cynical but extrapolates from that experience lessons we should all ponder. His vision is positive and he exalts human dignity.",
            "Frankl\"s life & experience gave him wisdom and determination that allowed him to provide excellent guidance for handling difficulties we encounter in our lives.  Three years in Nazi concentration camps and surviving followed by a life of introspection and teaching makes his wisdom invaluable."
        ],
        "Rating": "5"
    },
    {
        "Title": "USA STOCK The Body Keeps the Score : Brain, Mind, and Body in the Healing of tr",
        "Price": "$10.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Very good read. In this book, author Bessel van der Kolk, M.D. contends that many psychiatric patients are misdiagnosed, largely because those who determine the content of the DSM have chosen not to include a Developmental Trauma Disorder diagnosis. Without the clinician's option to diagnose Developmental Trauma Disorder, patients may be misdiagnosed as having ADHD, bipolar disorder, borderline personality disorder, and many other anxiety-related labels, he says. He explains that a more accurate  diagnosis could lead to more practical treatment. Citing numerous research studies, van der Kolk establishes a connection between mind and body and relates said connection to trauma at various stages of life -- from childhood abuse and neglect to war-related PTSD. Part of the joy of the read is van der Kolk's fairness in granting that some treatments such as eye movement desensitization reprocessing (EMDR) aren't yet fully understood even though they seem to be beneficial to many patients. Another part of the joy of the read is that the narratives and case studies sprinkled throughout the text keep the action flowing in a sea of statistical evidence. I'd recommend this book to clinicians, teachers, doctors, nurses, policemen, firemen, war veterans, parents, grandparents, and almost everyone else as I suspect we all either deal with our own trauma or know people who, as a result of their trauma, create chaos in others' lives. This book is enlightening and promotes hope for those who have experienced trauma.Read full review",
            "This book had fascinating illustrations of how trauma affects a person not only psychologically, but physically.  It makes you understand why some people are the way they are---anti-social personalities, people with anger management issues, etc.  It also gives some compelling evidence of unconventional therapy techniques that have shown great promise but discusses how our society seems to prefer lifelong treatment of a problem with drugs rather than treating the underlying cause and freeing a person from the burden of trauma that they carry with them throughout their lives.  The author is a psychiatrist who specializes in treating trauma patients from early childhood through adulthood.  Fascinating!",
            "I have PTSD and have been in therapy for 16 years.  This book is a must read for sufferers and help providers alike.  It is written by an extremely well qualified  research scientist with many years of treating and research.  The case studies are very interesting.  He provides information from the medical and clinical viewpoint.  The information on treatments and medications are very interesting.  As a patient I find the history of treatment and discoveries of great interest as I have seen the developments from the patient side.",
            "This is a really great book that explains how trauma damages people. The brain doesn't heal from trauma unless it's \"taught\" to (this isn't in the book, it's my own opinion after 25 years of being a therapist.\" This is a great book that's eye opening and healing for many who have experienced any form of trauma. Some reactions are trauma based and some are psychiatric. There is a difference.",
            "Finally, here is writing about the history of the PTSD diagnosis and how it came to be.  And the compassion and caring that these psychiatrists and therapists and researchers express for their patients/clients is very touching.  To me, it's as good a book as \"The Road Less Traveled\" by M. Scott Peck, MD.  Easy to read, lots of case histories that actually make sense, and are to the point, and the history of research into causation and the relationship between early childhood trauma, and how the brain adapts in order to \"function\" after it interprets the trauma.  Researchers are actually developing standards for measuring what used to be thought of as \"immeasurable\".  As an accountant and financial analyst, it's the kind of stuff I LOVE!"
        ],
        "Rating": "5"
    },
    {
        "Title": "us stock The Myth of Normal (Lead Title): Trauma, Illness & Healing in a Toxic",
        "Price": "$12.57",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "us stock ATOMIC HABITS (PAPERBACK) - JAMES CLEAR-Free shipping..",
        "Price": "$9.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Whole-Brain Child: 12 Revolutionary Strategies to Nurture Your C - VERY GOOD",
        "Price": "$6.28",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This book stresses the importance of staying in close contact with your child so you will know when to take the opportunity to listen with your heart and then be able to gently lead them into their logical reasoning. Throughout the years of child rearing and teaching I have read many books on the brain.  This one is very practical offering strategies that can really work",
            "IF YOUR STRUGGLING  AND YOU WANT TO DO THE BEST FOR YOUR CHILD(REN) ...YOU WANT THIS BOOK. IT HAS BEEN MORE HELPFUL THAN ANYTHING I HAVE READ THUS FAR AND I HAVE READ PLENTY. EASY TO UNDERSTAND AND APPLY TO DAILY LIVING. GREAT HELP FOR YOU AND YOUR CHILD! I RECOMMEND THIS FOR TEACHERS AS WELL!",
            "The book came practically brand new. I love the content so far.",
            "Great book st a great price!!!",
            "This book is in good shape. It is very useful information and I am glad I purchased it."
        ],
        "Rating": "5"
    },
    {
        "Title": "Lord of the Flies - Paperback By Golding, William - GOOD",
        "Price": "$3.98",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Had to read it in college (1971).  Decided to read it again today.  It was an amazing adventure. Piggy was my hero....But....",
            "Book was somewhat worn. But was readable for my child's book report",
            "I did a little research @ trade paper reprint.  The wording is bigger and no wording is changed in the reprint from the original.  That is why I bought this book.  Good choice!",
            "Not the book pictured but will do the job",
            "Listed as used very good. Was what I would call readable."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Good Girl: An addictively suspenseful and gripping thriller - GOOD",
        "Price": "$3.99",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "The book is written in pieces.  Each chapter stands alone, and you have to integrate them into the overall story.  This took me about 1/3 of the book to get used to.  It has a surprise twist at the end, which hints lead the reader to, but most will miss the hints.  I suspect the author wrote it 'continuously', and then cut it up to assemble the book into its 'salable' form.  Once i got used to it, i could follow the plot fairly well.  Interesting read!",
            "Highly recommend. Read it as part of a book club. The ending is unexpected. A great read !",
            "I flew through this book in record time, it was exceptional! If you’re interested in getting lost in a Book this weekend, try this one, you won’t regret it!!",
            "This is an excellent read! Could not put it down!",
            "Clean and what I wanted for my book club\nGreat value"
        ],
        "Rating": "5"
    },
    {
        "Title": "Do Hard Things: A Teenage Rebellion Against Low Expectations - VERY GOOD",
        "Price": "$3.73",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "As a parent of teenage twin boys and 20 -year teaching veteran, I first heard of this book from a high school student.  After speaking to the newly inspired reader, I borrowed the book.  The same night, I ordered two copies for home that will eventually land in my lending library.\n\nThe writing is accessible and easily understandable.  The difficult topic of how to motivate teens is effectively addressed. There is a religious message within the text, but it is not overwhelming or alienating for someone who doesn't feel as strongly or of the same faith.\n\nMy teens resisted (imagine that) reading a nonfiction book  -- at first.  Then, they started really reading the content.  Fight over.  My family of five is all reading the book; with only 2 copies, we have to share.  There is no doubt we will finish and come away stronger: alone and together.\n\nOverall, a great read for teens, parents who want to understand and motivate them, and teachers who want to educate them.Read full review",
            "As a father of 3 teenage daughters, I would HIGHLY recommend parents to purchase/borrow this book. I had heard several stories about this book and/or it's authors, so I decided to give it a try. I purposely read it during my lunch hours prior to giving it to my children, just in case. I sincerely wish there had been a book of this character when I was a preteen, mainly to have something to light a fire in my future.\nThis book lets the young people of today, and the future, know they don't have to settle for the norm, and to \"wait until you get older\" to achieve your goals. They don't have to except the \"dumbing down\" our society and education process have excepted. They can be responsible at an early age and except challenges in their lives. Most importantly, it let's them know that no matter what, God Almighty will be by their side EVERY step of the way.Read full review",
            "My 16 year-old wanted this book, so I got for her and her brothers. I read it first, so if any questions came up, I would be prepared. What I didn't expect was how it spoke to me. There is a chapter named \"Small Hard Things\" that is so needful! That was the best chapter! You can do a lot of big things, but if the little things don't get done, sooner or later there will be a price to pay.\nI really liked the book and wish every teenager from 10 to 30 (yes, I have some 30 year old \"teenaged\" relatives) could read this book, AND apply it! Churches need to have classes with this, give it to graduates, because it is an excellent resource.\nIf you have a \"teenager\", this book is an excellent choice for them!! But read it yourself first, because you will be challenged to change your life!",
            "I purchased this book after seeing a video clip from our church's youth pastor, as a promo for the conference that our youth group would be attending in Mpls. My plan had been to read the entire book before attending the conference with two of my children. After starting the book I realized that the book was so full of information that it could not be read quickly, in order to properly digest all that it contained. I have taken so much information out of each chapter so far. I meet with my kids multiple times a week to discuss that meetings reading assignment, generally one chapter every two days. I would recommend this book to everyone. Although geared to the younger generations, the principals apply to all. This book lays the challenge right our before you! If you want a challenge, readthis book and put into practice what it says! Your life can't stay the same and be unaltered if you choose to \"DO HARD THINGS!\" Our society could use more people with the attitude, determination and outlook this book promotes. A must read for ages 9 and up!Read full review",
            "I am an adult and wished I had a book like this when I was a teen. It gives real life experiences of other teens who wanted to accomplish big things but didn't know how to start. The book is easy to read and gives understanding, teaches problem solving, and encourages  teens to make the most out of their teenage years. It encouragingly, gives food for thought to all who know they have a purpose in every season of their lives, but feel stuck. This book is a testimony to what teens can do when they put their minds to it."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Psychology of Money: Timeless lessons on wealth, greed, and happiness - GOOD",
        "Price": "$11.00",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Heavily informative. Currently still reading, it's slightly entertaining with some anecdotes but rather focused upon details. Still have yet to fully finish but it's life changin!",
            "Great book and easy to read and put down temporarily.",
            "This is a must read if you want to learn and control your money",
            "The book came in like new condition.  The content is compelling and entertaining.  I recommend it.",
            "Great insight into how people behave with their money"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Five People You Meet In Heaven - Hardcover By Albom, Mitch - GOOD",
        "Price": "$3.93",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I found this book to be very thought provoking long after I finished it.  I continued to reflect on the characters and the life of the characters for months.  I talked about the book and passed it on to many other people.  I even shared a passage at group study that had nothing to do with books or heaven.  That's what makes it such an excellent book for me, the fact that it applied to many different areas of life.  This book has something to say about a person's life and the title is misleading to those who think it is all about or just about Heaven and/or God. I found it to be easy to read, though some elements were almost too simplistic.  Having read Mitch Albom's \"Tuesdays With Morrie\" first, I was somewhat disappointed by this simplicity.  I think the story theme could have stayed simple, as is Albom's writing style, but still used a bit more detailed written word.  In this book, I think Albom needed to do this because the story really exercises the reader's mind.  I would recommend this book to anyone who likes to read something that does more than just entertain, but will also challenge them in some way.Read full review",
            "\"Five People You Meet In Heaven\" The story begins at the end of Eddie's life. Eddie is an elderly maintenance that worked almost his intire life at the same amusement park, Eddie is unhappy and feels that his life is meaningless...\r\n\r\nEddie dies while trying to save a little girl from being crushed by a ride in the park. He awakens in heaven where he meets five people whose purpose it is to explain to Eddie the events of his life.\r\nNow its Eddie's job to find closure with every person he meets,\r\nEach character changes Eddie's perspective about life..and for the first time Eddie see things clearly and what really happened...\r\nIn his journey Eddie finally finds peace,and discovers that his life wasn't meaningless at all.\r\n\r\nI was very impressed with the way Mitch Album succeed once agian to bring an imaginative, creative tale, that inspired and moved \r\nme in so many ways...Read full review",
            "This short fiction is amazing only in that is has sold as well as it has and that many people actually like it. Human nature draws us to find a description of Heaven. M. Albom's title gives the illusion that one might find a realistic, perhaps verifiable account of what Heaven will be like. Albom is so far off from the truth that any real believer of Heaven and hell would toss this novel on the floor in disgust as I did. A seasoned writer could spit a book out like this in less than a week; \"The 5 People You Meet in Heaven,\" is elementary reading level, void of all substantiation, and even depressing if Albom's opinion is considered accurate. I wouldn't take a copy of this novel for free. I couldn't even sell it at a yard sell in good faith; I threw my copy inthe trash. I couldn't pass on such sacrilege written with no compelling hints of truth that would inspire a person to seek further.Read full review",
            "I found this book quite confusing and didn't get the message the author was trying to get across.My mother gave me this book she loved and gave me a copy to read.She also said I can keep the book. Three months later my mother passed away suddenly or maybe she  didn't she not tell us she was very sick to protect her children  one final time. I learned later that she gave all her children four including me the same little red book about the same time.\r\n     I knew I would read this book with a new perspective especially in the early mourning stage, I was missing her much more than I ever imagine.I  re=read the book which is rather short, and as I cried and tears stained the pages I knew that my mother would be one of the 5 people I will meet in heaven because she was  always therefor us in heaven.\r\n  The book has a very direct message . What we do and how we live our lives is our choice, life is short and \"live each day like it is your last\"  you never know when that day will be like the main character Eddie a simple older man,   who  knew all he would ever be is a man fixing rides in a run down amusement park which is dull and meaningless it seems Eddie is a inspiration to all mankind because he is  dedicated to this job and  concerned about the safety of all the ride running safely.Ironically, he dies trying to save a life of a little girl who falls out of a defective ride.Death a total surprise  was a result of another person not properly doing his job and a ride broke apart iro making sure it was running properly, ironically Eddie died doing the job he loved .\r\nI started to think of anything I did in my past that possibly caused another's death,For every action there is a reaction. Every life is meaningfull and Eddie is a inspirational charactor in this story. We are all equal in the the end no mattter how much money or material things we acquired in life. How we lived our live and how we treated others is the only important things we take with us after we leave this world. Eddie also learns that while we are alive we must resolve personal grudges and let anger go before its to late especially with loved ones. Eddie still has ro face this issue with his father. The point validify love and work out problems with loved ones while you are both alive, death may not give you a chance to finish personal business and that is final we  don't get another chance. \r\n  The book is rather short , I read it in about 2 hours, a great beach book!\r\n It is great for those who like Sylvia Brown and John Edward's books, like their books this little red book opened up a new way of looking at the world and although my mother is gone she gave us hope giving us this book that maybe one dsy we will meet in heaven.\r\n  This book is timeless original Book reminds us one day will die and death may come very when you least expect it.The writing is excellent  original and tells a very inspirational story . I read it months ago and I still think about this book almost daily. It has helped me to get out of bed snd to start to living again> My mother is gone but not forgotten,She would sayz\"this too shall pass\" meaning get on with your life.\r\n   This book is to  be a  bew classic for generations to come. Read this book!!!Read full review",
            "Doubtless, this was one of the most touching and emotional books I have ever read.  It was recommended to me by an elderly minister in Abilene, Texas.  When I first picked it up and started to read, I hated the beginning ... I wanted to put it down ... but I kept on reading.\r\n\r\nOne of the things that made the book so endearing to me, and which kept me reading, was the introduction of each new and totally intriguing person that would take the main character of the story back into and through another segment of his life already lived.  Meeting them is quite an adventure.\r\n\r\nMitch Albom's gift at description is marvelous; the reader can practically see what is happening every step of the way.  And yet there was simply no way to anticipate where this uncanny journey backwards in time would lead the main character, or how it would so delightfully carry him to the end of the journey, his quest for understanding and answers.\r\n\r\nThere is a mathematical oddity we identify as \"the six degrees of separation.\"  That came to mind throughout this book.  In life, we may never discover the way in which a decision we made, or an action we took, impacts another -- someone we might not have ever met.  This book causes one to consider that and step more carefully.  Life is fragile.  And temporary.  The storytelling is remarkable, so perfect, so applicable, so thrilling.  There is great satisfaction in reading this book and enjoying the beautiful tie that binds it all together.Read full review"
        ],
        "Rating": "5"
    },
    {
        "Title": "Psychology Hardcover David G., DeWall, C. Nathan Myers",
        "Price": "$7.66",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "The textbook came in excellent condition, just as described. The book itself is clear and understandable. It has quizzes at the end of each chapter and questions throughout each chapter to ensure that the material is correctly understood.",
            "We chose to purchase this particular book because it was listed as \"Good.\" In the description of good, it specifically says \"no highlighting\" Yet, upon receipt, we opened to find that at least a 3rd of the book was heavily highlighted. This was highly dissapointing. Otherwise it was in fairly \"good\" shape.",
            "I saved so much money through this purchase, cheaper than renting or buying a physical copy or ebook from another source. link was emailed to me the same day I purchased it! really helped me out",
            "I purchased this for a relative attending college.  The book was exactly what she needed.",
            "Very convenient e-book and exactly what I needed for my psychology class this semester for a very affordable price."
        ],
        "Rating": "5"
    },
    {
        "Title": "One by One - Paperback, by McFadden Freida - Very Good",
        "Price": "$8.94",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Great book"
        ],
        "Rating": "5"
    },
    {
        "Title": "Read People Like a Book: How to Analyze, Understand, ENGLISH, PAPERBACK USA ITEM",
        "Price": "$10.03",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Quick pleasurable read. Enjoyed."
        ],
        "Rating": "5"
    },
    {
        "Title": "The New Couple: An absolutely addictive psychological thriller with a sho - GOOD",
        "Price": "$5.05",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Brooklyn - Paperback By Toibin, Colm - GOOD",
        "Price": "$7.19",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I finished reading the book in short order.  This may be because I already saw the movie version.  The book and movie  plots are  the same.  However, the movie adaptation of the story is a little bit different.  The book has some additional characters and situations.  I liked the movie so much, I couldn't wait to read the book.  I would have to rate the movie higher than the book version.  This may be due to the excellent performance of the actors.  Also, I liked the ending in the movie better than the book ending.  The movie version gives the viewers the sights, sounds and scenery of the years it all took place.   The facial expressions of the actors, and the tone of their voice can not be duplicated in the book.  The movie is rated PG 13  This is an appropriate rating for this movie version.  If the movie contained foul language and nudity it would have been rated R.   Thankfully, the movie version does not contain this content.  Reading the book will allow the reader compare each version of the story.Read full review",
            "Brand new book,  looking forward to reading it.",
            "A great story of a young girl moving to the States from Ireland in the 50's."
        ],
        "Rating": "4"
    },
    {
        "Title": "The Explosive Child: A New Approach for Understanding and Parenting Easil - GOOD",
        "Price": "$3.80",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "If you have the energy to put forth great parenting this book is a great read.  It's a neat approach to solving problems your kids have.",
            "As a therapist i found this book to be a real eye opener! i have a hard time reading books with info, But this book was amazing and interesting to read!! very very informative!!"
        ],
        "Rating": "5"
    },
    {
        "Title": "It Didn't Start with You: How Inherited Family Trauma Shapes Who We are a - GOOD",
        "Price": "$9.85",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Book is excellent quality, great ebay seller. The first few chapters of this title are excellent then it slowly gets a little woo woo and too intent on that the only way to heal family trauma is to make up with and contact them\n That isnt always safe or a good idea. Duh",
            "After having a personal experience I won't go into here, I realized I wanted to explore my ancestral trauma. Boy is this book so eye-opening! It led me to ask questions of my family members so I could better understand origins of some of my thought patterns. There is a lot of scientific data to correlate trauma from the past to struggles we have in our current lives. I definitely recommend to read this if you have any stubborn problems or debilitating ailments. 5 stars!",
            "This book will be an excellent help to me as I complete both my masters and PHD. I’m very excited to read this book.",
            "Very eye opening. Great book.",
            "Very thoughtful content. Very helpful to my professional practice."
        ],
        "Rating": "4"
    },
    {
        "Title": "The Mastery of Love: A Practical Guide to the Art of Relationship: A Tolt - GOOD",
        "Price": "$5.48",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I make no exaggeration when I claim that this book is one of the most important books of the last five hundred years. The universal truths and wisdom contained within it are everywhere from beginning to end and changed my attitudes about spirituality. The author certainly writes compellingly and  convincingly with each word. My views are forever influenced by the author. All of them. Buy this book. Start an inner exploration that will never end.",
            "I have bought this book several times and given them away to friends and family. Such a great book that gives a different perspective on life and living which is very positive and leaves you 100% accountable for your happiness. I am not really a fan of reading \"self help\" type of books because I always feel like I get the jist of them in the first few pages and like they are all the same. This one for me was different and the way it explains everything is very clear. I try to keep my own copy and and re-read it because it teaches you a different way of thinking entirely which takes alot of practice in order to reverse years/ lives of thinking the typical way people are used to.",
            "I was pleasantly surprised at how clearly the author writes. Some held improvement books get into buzz words and nebulous phrases. Not here. He writes like he is sitting in your living room. His ideas are well thought out and put forth simply and clearly. I recommend this book.",
            "I've seen snippets from this read in various places so I knew I'd be in for a treat and the book doesn't disappoint at all! I absolutely love the teachings and wisdom given. Yet another read I will likely return to for years to come",
            "This book is easy to read and hard to put down. Chapters like the Magic Kitchen, and Sex, the biggest demon in hell, speak plainly of the misconceptions that our society and religions have mandated for us, and that keep us in slavery to a book of rules that everyone follows out of fear. We find ourselves here in life with three controllers: The Victim, the Judge, and the Book of Rules. We play the victim, we judge ourselves and each other, all according to rules that are not understood or sensible. But don't believe me, read the book. It's a real eye opener."
        ],
        "Rating": "5"
    },
    {
        "Title": "Beyond the Trauma Vortex : The Media's Role in Healing Fear, Terror, and...",
        "Price": "$72.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Psychology of Money Same as Ever and The Diary of a CEO 3 Books Set New",
        "Price": "$28.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Shop on eBay",
        "Price": "$20.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Shop on eBay",
        "Price": "$20.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Metaphor of Play : Disruption and Restoration in the Borderline...",
        "Price": "$7.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Talking from 9 to 5 : How Women's and Men's Conversational Styles Affect Who...",
        "Price": "$5.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "3 Book Collection Set (medium) Power+ Atomic Habits and Psychology of Money PB",
        "Price": "$21.48",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Confident Mind A Battle-Tested Guide By Dr. Nate Zinsser New Stock Fast Ship",
        "Price": "$20.75",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Great content and well worth the read.  One of the few titles this year I haven’t been able to put down."
        ],
        "Rating": "5"
    },
    {
        "Title": "Switch On Your Brain: The Key to Peak Happiness, Thinking - VERY GOOD",
        "Price": "$4.36",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This book explains how our brain and mind work as God’s creation.  Our brains and thinking can improve which is exciting.  The book is not an easy read for someone who has no medical background but I am reading slowly and absorbing.",
            "Most useful book eber written for true loving Christian people who desire to stop being depressed and worrying and hopeless and angry. You have to be astout enough to know you are not joyous nd to take action. 21 baby!!",
            "A great book to realize that our minds are in charge over our brains and that we are created in God’s image and our thinking does matter and Dr Caroline Leaf does such a good job saying that science is finally catching up with the Bible! Everyone should read this book!",
            "An awesome author. This is a textbook on how the brain works for non scientific minds.",
            "This is the best book I have ever read that helps one take responsibility for attaining a positive mindset that will lead to mental, emotional and physical improvement or well being."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Silent Patient - Paperback By Michaelides, Alex - GOOD",
        "Price": "$5.89",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This is a great book!  Highly Recommend",
            "I haven't finished it yet, but I have no idea where it is going, so the ending will be interesting!",
            "Could not put this book down. Definitely had me twisted at the end.￼",
            "I love this kind of psychological thriller with a surprising twist at the end.",
            "good thriller so far"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Silva Mind Control Method By Jose Silva (1991, New Paperback)  ENGLISH  USA",
        "Price": "$9.65",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Nice book but it only covers the very basics. You then need to go to one of their center to expand the process to next level. I still got a great value for the price I paid for the book."
        ],
        "Rating": "3"
    },
    {
        "Title": "Emotional Intelligence: Why It Can Matter More Than IQ - Paperback - GOOD",
        "Price": "$5.03",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I recommend this book to absolutely everyone. It's astounding! If people would read it and totally absorb it's message, the world could be changed for the better. The best thing I've learned thus far is about being hijacked by my emotions. I learned that I am the kind of person who can be easily taken over by emotion because I'm prone to thinking too much and .... Well, Mr. Goleman explains the whole thing in the book. But what I learned is to control my emotions, my thinking, by becoming aware of my emotions, particularly strong emotions, when I'm experiencing them. By engaging the rational part of my brain while experiencing strong emotions, just the act of trying to engage my thinking that way, it lessens the intensity of the emotion. It's amazing!",
            "VERY INFORMATIVE AND SPELLBINDING - CAN'T PUT THIS BOOK DOWN.  HIGHLY RECOMMENDED FOR ANYONE WHO LIKES TO READ AND BE SO INFORMED AND ENRICHED!",
            "This book was required for a class I’m taking. I got an absolutely awesome deal! There’s also some interesting information in this book if you’re into psychology.",
            "They said the book was used but it was practically new. Very happy. Thanks"
        ],
        "Rating": "5"
    },
    {
        "Title": "One Perfect Couple by Ruth Ware (2024, Hardcover)",
        "Price": "$19.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Everything was perfect!"
        ],
        "Rating": "5"
    },
    {
        "Title": "Essentialism: The Disciplined Pursuit of Less - Hardcover - ACCEPTABLE",
        "Price": "$4.90",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "The book is a plea to all those with busy lives to look at what is most essential to them and build a life around it before it is too late. The book provides some simple guidance from how to put aside time, how to figure out what is important and how to edit your life or the things that are not contributing to your vision.",
            "You should read this. It has clarified and de stressed my life- and the clarity may also offer this opportunity to you!",
            "I have not read this book yet but it come highly recommended.I have my copy sitting at the top of the pile to read next.",
            "I watched a short video on YouTube featuring Greg McKeown and knew that I must purchase his book on eBay. I was not disappointed. The book \"Essentialism - The Disciplined Pursuit of Less\" isn't about getting more done in less time. It is more about getting only the right things done. The lessons taught and the examples shared give a clear path to determine what is essential in our lives and business and to reclaim control of our choices. Highly recommended.",
            "Found the ideas contained powerful-- it could have been much shorter though."
        ],
        "Rating": "5"
    },
    {
        "Title": "Emotional Intelligence Habits Change Your Habits Hardcover",
        "Price": "$11.68",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The New Drawing on the Right Side of the Brain - Paperback - GOOD",
        "Price": "$4.57",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Definitely more than just an instruction manual for drawing. It focuses more on developing the perceptive and mental abilities used by artists to draw what they see. Some books have exercises that improve your abilities by simple repetition and rote and while you certainly won't get any better at drawing (or any other activity) without tons of practice, the exercises in this book are more unique and heavily focused on teaching you how to see like an artist and how to transfer those abilities to paper. I feel like some of the conclusions the author makes about neuroscience and how it relates to drawing are a little dated and stretching, but the basic science is there. I recommend getting the exercise workbook that goes along with the title but there are plenty of actual exercises in the text alone.\n\nIf you read this book, follow the instructions and do the exercises, unless you are already a Da Vinci, your drawing abilities WILL improve.Read full review",
            "Very simply, this is a book that anyone and everyone should purchase if they have any interest in learning to draw portraits.  Ms. Edwards has proven that everyone possesses the ability to draw realistically.  Pick up a copy of this book and look and the before and after drawings.  If that doesn't convince you that you too have the untrained ability to create awesome drawings...\n\nGive Ms. Edwards' ideas a try.  You will shortly realize the \"truth\" of her position as you work her fun-to-do exercises.  Even it the assignments were not fun, the rapid progression of your drawing skills would make them well worthwhile.  Obviously this book is not a artistic \"magic bullet\" but you will learn to draw with a realism that is almost photographic.  Forget your preconceived notions about your drawingskill.  I promise you a very happy surprise; you can draw.\n\n\nPlease spare two seconds to click the YES link at the end of this page if you find this review interesting, useful, or informative. It makes all my effort feel worthwhile.  But, if you don't find this review helpful please send me suggestions on how to make it better.  Thank you.Read full review",
            "This book teaches not only how to draw, but helps you discover the right side of your brain and how to change AT WILL, and therefore changes how you view everything around you.  Your left brain is a \"know-it-all\" but doesn't really \"see\".  The right brain is what you need to really discover what's there.  This book will get you there.  If you can, you should also get the workbook that goes along with it.  But just this book will do!!!!",
            "i really liked this book about drawing. before i drew faces like cartoons and now i can copy pictures from books quite good. i am very proud of the drawings i do now and i owe it all to this book. im waiting till i master my skill to show of the drawings to friends and family. my favorite part of the book the part where it says to draw upside down pictures which has helped me the most(you'll get what im saying when you read the book) its really really worth buying for 10bucks- you can spend this on a meal, why not on something that you will enjoy. when you draw you dont have anything else on your mind and that is a great feeling. maybe they could improved the book with more pictures, but they have good enough pictures anyway.",
            "You can really learn how to see better when drawing. This is updated version of book I had years ago. Just do the lessons and your drawing will improved. Thanks for quick shipping. Book is in very good condition."
        ],
        "Rating": "4"
    },
    {
        "Title": "Хорошие девочки отправляются на небеса, а плохие - куда захотят psychology RUS",
        "Price": "$14.87",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Psychologist's Book of Personality Tests : 24 Revealing Tests to Identify...",
        "Price": "$4.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "This book is a good idea, but its harder to score the tests than I'd hoped.  I wish it had a very simple scoring system.  The areas of focus are good."
        ],
        "Rating": "3"
    },
    {
        "Title": "Diagnostic and Statistical Manual of Mental Disorders Ser.: Diagnostic and...",
        "Price": "$4.06",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "I love this book because I now have something to compare to the newer DSM-5 that I have.   I think mental health experts should go back to using the DSM-IV because this great book gives separate identities to those on the Autism Spectrum instead of making these 5 diagnoses into 1 diagnosis, simply called the Autism Spectrum Criteria.  The DSM-IV has so much more going for it because it is better organized and have a lot of interesting reading.",
            "Bought this to replace the one I tossed four years ago. Decided I wanted to refill the gaps.",
            "This book is in PERFECT condition! I could not believe how beautiful it looks for the low price! It’s in better shape than my newest edition of the DSM!",
            "I bought it for a friend that does not know how to buy things online.  He is   pleased with the book.",
            "Good source of mental health diagnostics"
        ],
        "Rating": "5"
    },
    {
        "Title": "Blink : The Power of Thinking Without Thinking by Malcolm Gladwell (2007,...",
        "Price": "$2.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "In Blink, Malcolm Gladwell offers his account of humanity's seemingly instantaneous judgment in critical situations.  The book features a series of fascinating anecdotal case studies, skilled interweavings of psychological experiments, explanations, and unexpected connections which have become part of Gladwell's writing style since Tipping Point.\n\nAt the outset of Blink, he illustrates how incredibly complex decisions are often made in the matter of seconds: experts on Greek art, who had no vested interest in judging a rare 6th-century sculpture of a youth as authentic, sensed immediately that it was fake.  But Gladwell points out that if expertise, or mere accumulated experiences sufficed, humans could unerringly trust these decisions made as rapidly as the blink of an eye, but, as he illustrates through several counterpuntal stories, such blinks can also be deceptive.   It should be noted that he seems to stretch some of his examples to conform to his blink-of-an-eye theory.\n\nGladwell is an impressive synthesizer and is, in that sense, a model for both teachers and students.  Because of his skills as a journalist, the book is accurate and informative -- complete with numerous anecdotes.  Blink is a satisfying and informative read, but not as scholarly as some might have you believe.Read full review",
            "Some great 'aha' moments and quick read. Gladwell uses great examples and a lot of back up data including websites to confirm his thesis. Decisions due to your first few seconds to the pitfalls of when your intuition can be blind sighted.\nKey to the thoughts for me was the relevance of listening to your gut and acting on your impressions does have value and is based in man's DNA for survival. Often second guessing ourselves or over analyzing issues leads to inaction and acceptance. Recognizing what can harm you or a 'toxic' boss or relationship sooner than rationalizing 'bad for you behaviors' is epic to survive in the corporate world rift with undermining basic instincts that can lead to greater success.\nI have attended top level executive meetings for two major US Comapnies where Gladwell spent two hours a week in ignoring gut needs and expounding on over analyzing to the point of inaction and worse continue the game with their staff so all are spinning wheels to no avail. Those companies are not successful.\nCorporate America should make this book a read for any executives struggling with today's economy to get back to the first impression and swift action to market or acknowlege sooner to trust the front line employees more that are hands on doing the work that is no longer creating progress for the very company that puts food on their table.\nI have seen the last five years of my current company unable to decide about who should be the CIO (five in five years)not to mention to CEO's.\nI don't feel crazy anymore for thinking how idiotic over thinking Executives plan their strategies for their goal only to wordsmith it to the point of indecision once again then fire that Executive team and bring in a new group only to have them repeat the same mistakes allover again without the expertise and gut interpretaions of employees that can give the new team the insight that what they are proposing already failed in the past.\nSo I recommend this read for all Executives and embrace it with open minds and then pass the book down through the ranks and empower their employees to help with their first take and move the companies forward.Read full review",
            "I love Malcolm Gladwell's style of writing, some parts you can skim over and still get the jist of the point, but the power of our unconscious thinking in rapid cognition decision-making is brought forward by Gladwell throughout the book by various easy to relate to examples. I find myself constantly trying to bring my unconscious mind into combination with my conscious mind by thinking of ways to thin-slice decisions on expert intuition instead of loading my conscious down with such an overly abundant amount of information that I lose sight of what I was trying to accomplish in the first place. Nice, easy read. Thumbs up!!",
            "I love Malcolm Gladwell books.  His writing style combines a unique and great mixture of down-to-earth explanations of heady themes with easy to understand words and explanations.  Books like his (including the previous release \"Tipping Point\") really help average readers who aren't intellectuals understand some pretty intense and 'hard to wrap your head around' psychological, statistical and historical trends that just happen to affect almost all of us at some time or another in our lives.  This material is a fascinating and quick read and you'll find that it is filled with so many facts that you'll be telling your co-workers, friends and family about so many different and interesting things that you've learned by reading it.  I highly recommend this book."
        ],
        "Rating": "4"
    },
    {
        "Title": "Lord of the Flies by William Golding",
        "Price": "$4.58",
        "Author": "by William Golding | PB | Good",
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I've loved Lord of the Flies for a long time, but so many of the covers are absolutely hideous.  This is the cover I've been wanting.  It's a used book, but wear is minimal, and all things considered it's in great condition.  The photographs accurately displayed what I was going to get.  I'm very happy to finally have an appealing cover for this excellent story.",
            "Haven't read this book in 20 years.  Book was in used conditionbu, lightly used...  great value!!!",
            "William Golding’s Lord of the Flies is simply one of the best novels written. The book appears on virtually every Best 100 Books list.\nThe story involves a group of British children who are stranded on a tropical island. They initially organize around Ralph, and begin to prepare their island paradise for survival, while also maintaining a fire to alert any search party of their presence. The group creates rules for their mini civilization.\nConflict begins when Jack organizes his group of “hunters”, rejecting Ralph’s authority. The civilization descends into chaos, and even murder as the hunters challenge Ralph.\nCan society be organized around logic and order? Or is it man’s nature to reject order? Can society (government) rule by consent of the governed, or must it rely on force and the threat of force to maintain order?\nThere have been two film versions of Lord of the Flies , in 1963 and 1990 (as well as other derivative films), both films are excellent.\nRead the book! Watch both films!Read full review",
            "Great deal.  I ended up ordering the book for my daughter's summer English assignment.  All the books were in use at our public library.  Good thing we bought our own copy bc she needed to take cliff notes in the book.  Once she has finished the book, I'll get a chance to read this classic again.",
            "The book price was good for the condition it was in. I purchased it for a student at school who has been required to read it in a class."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Privilege of Youth: A Teenager's Story - Paperback By Pelzer, Dave - GOOD",
        "Price": "$3.69",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Another inspirational narrative about the journey of Dave Pelzer entering adulthood. This \"series\" I suppose you can call it makes you laugh, cry, and gives readers a chance to look at the life of a child/teen/man who suffered years of abuse by his own mother. In this book, it journey's Dave's life as a teenager, and the trials he has gone through while being in foster care. Another amazing book, one that will make you overly emotional!",
            "I bought this book because I have read the book The Child Called IT and the book was amazing... I love the courage to write a book about his awful childhood and\r\nand the triumph he had to over come it all ..... The books this man has wrote about his life of child abuse should be in every school in the world and read to students..... I have read all of Dave Pelzer's books and I LOVED them all they made me cry and laugh at times .....I just hope that his books have helped many of people over come the terrible things that have happened to them in there lives!!!",
            "This book in Dave Pelzer's series of books on his life provides insights into not only a teenager who experienced abuse but also to many teenagers at this time in their lives.",
            "Damaged as in writing inside and ripped in a few places and back is only half way attached. Guess for the price it isn’t bad just wasn’t aware of such flaws",
            "This is an honest and enlightening story, detailing the life of a teen survivor of child abuse. Survivors of child abuse lack the boundaries that most people learn in their family units.  They are alone to learn them.  This is also one of the positive examples of how the foster care program can turn things around for a child. This is a good book for anyone in social services and anyone considering foster care."
        ],
        "Rating": "4"
    },
    {
        "Title": "Dark Psychology: 3 Manuscripts How To Analyze People, Manipulation And Hypn...",
        "Price": "$16.22",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "On The Psychology Of Military Incompetence (Piml... by Dixon, Norman F Paperback",
        "Price": "$14.82",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Diary of an Oxygen Thief (The Oxygen Thief Diaries) - Paperback - GOOD",
        "Price": "$4.30",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "My daughter loves the book and it was in wonderful condition.",
            "Very good book, it's well worth reading you'll love it",
            "Love this book",
            "Came in in 2 day the book is good",
            "No words can describe it , no spoilers given though"
        ],
        "Rating": "5"
    },
    {
        "Title": "Why We Sleep: Unlocking the Power of Sleep and Dreams - Paperback - GOOD",
        "Price": "$6.78",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This author knows what he is talking about. This book is hard to put down. Greatly increasing my understanding of sleep. Well worth even a second read.",
            "A couple of criticisms:  1. Walker could have said it all in half as many words. 2. I was hoping to get information that would help me to sleep better.  Walker says nothing here about the impact of reproductive hormones, diet, pain or the phenomena of TV's ability to put you to sleep.  I did not need to be convinced that getting enough sleep is important.  But he does make that argument forcefully.  Borrow it from your library.",
            "Still in the midst of reading it, but hope it helps with my sleeping problems.\nOne disappointment: I inadvertently ordered the eBook version, whereas I wanted the paperback.\nIt was my oversight, so I am coping with the inconvenience.",
            "Very good content.  Sleep is such an important commodity in our busy lives.  Take the time to really read and value the content.",
            "Again, technical medically but great info.  Too many people that suffer sleeping.  Makes a lot of sense and simple to try.  Good warnings for those stuck on sleeping meds.  So scary what we let doctors lead us to believe is safe and good.  Need more people to challenge AMA and other levels of corruption in our country and broken health care system."
        ],
        "Rating": "5"
    },
    {
        "Title": "Morgan Housel 2 Books Set: The Psychology Of Money & Same As Ever (English)",
        "Price": "$15.19",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Naked Lunch - Paperback By Burroughs, William S. - GOOD",
        "Price": "$5.98",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This book is just impossible to get into. The words are eloquently puked upon each page and read as a poetic, twisted, tangled thought tangent. I believe I could leaf to any page, read them in random order, and I would comprehend this \"story?\" just as I would reading front to back. I appreciate the descriptive, dream-like writing, but I am unable to piece together the narrative. Maybe I am just too ignorant....",
            "Widely considered as one of the greatest pieces of American literature, Naked Lunch describes the dreamy, surreal and scattered thoughts showcase Burroughs' amazing ability to contort the English language in any way he sees fit. Chronicling the mis-adventures of Burroughs' alter-ego Lee the Agent through his life of getting high, avoiding the fuzz and finding his next fix, the reader is taken on a tour-de-force of various narratives that shift suddenly and without over-explanation. Anyone interested in Beat literature, Punk music, or counter-culture novels such as Fear and Loathing in Las Vegas would be extremely pleased with purchasing this wonderful and progressive novel.\n\n+ if anyone says that Americans can't write (which holds some truth) shove a copy of this book in their face.",
            "I love this book in all it's dirty, sodomizing glory. It's askew references to drug use and sodomy is one of Burroughs' best qualities which shine in this book. I love William S. Burroughs and his off colour humour and writing style. 5 STARS!!!",
            "One of the craziest read from a sociology class at Michigan State. Was made into a movie, which is a literal interpretation of the book. Great and crazy read!",
            "this is a good read, almost a must read. but its really hard to get through. youve gotta visualize what you read to understand. its alot to take in at first but sit back and visualize and it will start to make sense."
        ],
        "Rating": "2"
    },
    {
        "Title": "The Power of Habit: Why We Do What We Do in Life and Business - Paperback - GOOD",
        "Price": "$4.97",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This was a great book, hard to put down.  It explains how we do so much of what we do.  I even bought another copy to give my son.  It wasn't my intention when I started reading, but now I am using the ideas to work on not being so much of a workaholic.",
            "Great book, filled with stories of habit that keep you interested as compared to self help books which don’t really hold my interest as much. Easy read, I would recommend.",
            "This book is very interesting both from a personal and business perspective. Easy read, filled with compelling case studies and validated research. Enjoyable in understanding how the brain works and has application both in self-improvement, and in a business setting.",
            "I am enjoying the read. Its helpful and has some information that I have not considered before. The book is in very good condition.",
            "Finished it and would have been good if i bought it earlier XD give it a try A+"
        ],
        "Rating": "5"
    },
    {
        "Title": "Change Your Brain, Change Your Life: The Breakthrough Program for Conquer - GOOD",
        "Price": "$3.99",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "One of the best books I have read.  Gives us great insight into the problems our 37 year old son is experiencing.  Thank you!  thank you!",
            "the information is 20 years old. The author talks about getting brain scans so you can get on the right medication for your condition. I was under the impression when I heard him on TV that this was new info and that medication was not the answer. I should have done more research before jumping in and buying the book.",
            "I listened to the entire 11 CD audiobook (from my public library). I was enlightened & fascinated by the numerous Case Examples sited, often backed up with SPECT Scans to confirm a diagnosis and prescribe effective treatment.\n\nDr. Amen discusses how even a forgotten minor head injury may have effected brain function.\n\nIt helped me better understand why, based on individual & personal brain functions, I and my loved one, think and act the way we do.\n\nI wanted to see, visually, the diagrams refered to, and most importantly, the Check lists for evaluating a person with various mental conditions.\n\n\"Brain SPECT imaging is an aide in making neuropsychiatric diagnoses and individualizing treatment plans... SPECT scans looks at blood flow and activity patterns and is different than CAT scans and MRIs. CAT scans and MRIs show what the brain actually physically looks like, SPECT looks at how the brain functions. SPECT stands for single photon emission computed tomography.\"Read full review",
            "I like thiss book.  The brain is the part of the body that's not so easy to understand.  The way this book is put together makes everything so much easier to understand.  The pictures are in 3-D. It explains what the different parts of the brain are and where are located.  There are pictures to help you understand the different illness and see the damaged caused by them.  It help you to understand you own behavior. You get knowledge of why people act the way they do.\nI get this book to find out what I could do to improve my quality of life.  I now know what I can do to prevent some of the problems expected to come with age.",
            "This book provides a unique and clear perspective into the world of certain psychological disorders. Applying photos that show differences between normal brain functioning and bipolar, ADHD, and other disorders gives insight into common \"behaovioral\" problems. The author (Daniel Amen) demonstrates how all the proper parenting in the world will not solve a brain disorder and gives ideas for other methods (nutritional, educational, emotional, and prescriptive) to enhance moods and behaviors. My attitude towards many of the people I know has changed and softened because of this book. \r\n\r\nIf you read it, also check out some of the web sites that promote Mr. Amen's ideas further and be sure to note that over the several years that this book has been available, more therapy based on these ideasis available.Read full review"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Inner Work: An Invitation to True Freedom and Lasting Happiness by Cottrell",
        "Price": "$12.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Laws of Human Nature By Robert Greene Paperback",
        "Price": "$12.17",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Love this book. It’s understandable and well written"
        ],
        "Rating": "5"
    },
    {
        "Title": "An Elementary Textbook of Psychoanalysis by Charles Brenner (1974, Trade...",
        "Price": "$3.24",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Биология добра и зла на русском Robert Sapolsky Behave The Biology Russian book",
        "Price": "$59.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Don't Sweat the Small Stuff ... and It's All Small Stuff : Simple Ways to...",
        "Price": "$4.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Several years ago, I was going through a lot with family and work. One of my co-workers gave me this book as a present. It really helped me! There is so much great advice given in this book. A few years ago, my best friend showed up on my door step, because her husband and she had a really bad fight. Of course, I told her my house is her house, and she could stay as long as she needed to. A few days later, I was cleaning and came across my book given to me by my co-worker. I gave it to my dear friend and told her how much it helped me. The next day when I came home from work, she told me how much she enjoyed reading this book. She said it really opened her eyes and her mind. It wasn't long after that her and her husband were back together. Now, I'm not saying this is the answer to all of the problems people have, but it does give you a better perspective as how to handle things. Since then, I have bought a few more copies of this book, and gave them as presents to my friends.Read full review",
            "The mini-chapters (1-3 pages) make it easy to get the author's point and to see how t make almost immediate application of the concepts to life.  The book seems to follow this theme:  Minimize your self-misguided anxiety and maximize your joy of living.  The book is short enough to refer back to frequently for a refresher course on how to live a more peaceful life.  \r\n\r\nI decided to buy my own copy after reading through some of the chapeters while waiting in a doctor's office lobby.",
            "i've had this book before, so I remembered it. I like this book. it's a good read. I really do agree with this title of this book. my ex-husband & my current boyfriend are the type of men that \"Constantly\" Sweat the Small Stuff, when there really is NO Need to do so. It frustrates me to great lengths. I keep my mouth shut, cus showing them how much they frustrate me, doesn't help matters either. Thank God my ex-husband has been completely out of my life since November 29th, 2000. but my Current Bf..well....I Love Him, but he's driving me Crazy. I'm Hoping that this book will help him to see the error of his ways before it's too late. Life is Way Too Short to sweat the small stuff. People. just Let it Go, Let it All Go. You'll be much Happier& Stress Free if you would just Stop sweating the small stuff.Read full review",
            "This author wrote 2 other similar books (don't sweat the small stuff at work/with family.  I liked this one the best.  Each topic is about 2 pages, simple and gets to the point. There are situations where everyone reads and goes....I've been in that spot.  Its very good advice on how to learn what to do and think in stressful situations.  A family member wanted to read my copy and I bought them their own copy because I believe its a good book to keep for reference.  Every now and then I go back and refresh my memory of the lessons.",
            "I recommend this book for everyone.\nWhile it seems like dealing with daily struggles just takes a common sense approach, this book really helps you keep these issues in perspective and offers innovative steps to keep anger and stress in check."
        ],
        "Rating": "5"
    },
    {
        "Title": "Stages of Faith : The Psychology of Human Development by James W. Fowler (1995,",
        "Price": "$4.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "The book meets my expectations for study.",
            "IT'S GOOD."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Body Keeps the Score: Brain, Mind, and Body in the Healing of Trauma - GOOD",
        "Price": "$12.50",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Very good read. In this book, author Bessel van der Kolk, M.D. contends that many psychiatric patients are misdiagnosed, largely because those who determine the content of the DSM have chosen not to include a Developmental Trauma Disorder diagnosis. Without the clinician's option to diagnose Developmental Trauma Disorder, patients may be misdiagnosed as having ADHD, bipolar disorder, borderline personality disorder, and many other anxiety-related labels, he says. He explains that a more accurate  diagnosis could lead to more practical treatment. Citing numerous research studies, van der Kolk establishes a connection between mind and body and relates said connection to trauma at various stages of life -- from childhood abuse and neglect to war-related PTSD. Part of the joy of the read is van der Kolk's fairness in granting that some treatments such as eye movement desensitization reprocessing (EMDR) aren't yet fully understood even though they seem to be beneficial to many patients. Another part of the joy of the read is that the narratives and case studies sprinkled throughout the text keep the action flowing in a sea of statistical evidence. I'd recommend this book to clinicians, teachers, doctors, nurses, policemen, firemen, war veterans, parents, grandparents, and almost everyone else as I suspect we all either deal with our own trauma or know people who, as a result of their trauma, create chaos in others' lives. This book is enlightening and promotes hope for those who have experienced trauma.Read full review",
            "This book had fascinating illustrations of how trauma affects a person not only psychologically, but physically.  It makes you understand why some people are the way they are---anti-social personalities, people with anger management issues, etc.  It also gives some compelling evidence of unconventional therapy techniques that have shown great promise but discusses how our society seems to prefer lifelong treatment of a problem with drugs rather than treating the underlying cause and freeing a person from the burden of trauma that they carry with them throughout their lives.  The author is a psychiatrist who specializes in treating trauma patients from early childhood through adulthood.  Fascinating!",
            "I have PTSD and have been in therapy for 16 years.  This book is a must read for sufferers and help providers alike.  It is written by an extremely well qualified  research scientist with many years of treating and research.  The case studies are very interesting.  He provides information from the medical and clinical viewpoint.  The information on treatments and medications are very interesting.  As a patient I find the history of treatment and discoveries of great interest as I have seen the developments from the patient side.",
            "This is a really great book that explains how trauma damages people. The brain doesn't heal from trauma unless it's \"taught\" to (this isn't in the book, it's my own opinion after 25 years of being a therapist.\" This is a great book that's eye opening and healing for many who have experienced any form of trauma. Some reactions are trauma based and some are psychiatric. There is a difference.",
            "Finally, here is writing about the history of the PTSD diagnosis and how it came to be.  And the compassion and caring that these psychiatrists and therapists and researchers express for their patients/clients is very touching.  To me, it's as good a book as \"The Road Less Traveled\" by M. Scott Peck, MD.  Easy to read, lots of case histories that actually make sense, and are to the point, and the history of research into causation and the relationship between early childhood trauma, and how the brain adapts in order to \"function\" after it interprets the trauma.  Researchers are actually developing standards for measuring what used to be thought of as \"immeasurable\".  As an accountant and financial analyst, it's the kind of stuff I LOVE!"
        ],
        "Rating": "5"
    },
    {
        "Title": "After I Do: A Novel - Paperback By Reid, Taylor Jenkins - GOOD",
        "Price": "$6.37",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Almost finished reading. Love her writing. This is the second book I have read from this author. After completing this book will buy more of Taylor Jenkins Reid books.",
            "Great!"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Tipping Point: How Little Things Can Make a Big Difference - GOOD",
        "Price": "$3.97",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This book was a disappointment.  It basically stated the obvious, that certain factors \"tip\" people one way or another- context, persuasion, genetics, etc., and produce trends as well as personal preferences.  There wasn't anything in here that was not common sense.\n\nFor example, the chapter on why teenagers still start smoking even after decades of health warnings, etc., provided no new insight.  Basically, the reason provided was that kids don't start smoking because the action of smoking  is cool; they start smoking because the SMOKERS are cool.  In other words, cool people smoke, just like they do other things.  So to be cool, you'll emulate the cool people.  And smoking is one thing you can do to be like them.\n\nAlso, the author states that genetics is the reason why certain smokers become addicted (every-day smoking of several cigarettes per day, with great difficulty in quitting including withdrawal symptoms) and why other people can smoke very few cigarettes in a week, every week, for example, and easily stop doing that with no problem.  Since the concept of \"social smokers\" is quite well known now, I don't think this was any revelation.  Just like not every social drinker becomes an alcoholic, not every social smoker becomes a hard-core nicotine fiend.  And doesn't genetics cause pretty much everything? I've heard a figure of 80% of our behavior, traits, intelligence, etc. is genetic.  This may or may not be true, but the proposition that nature, rather than nurture, is controlling us is not a new idea either.  The \"masses\" won't be impressed with his ideas on genes.\n\nThis book was also very short.  I would have appreciated much more substance, and just more MATERIAL in general.  Thankfully I got this from the library so I didn't waste my money on a short, dissatisfying book that states the obvious and expects the public to be wowed by the \"insight.\"\n\nThe author seems to have rattled off this book in one sitting, perhaps as an afterthought, for what reason, I don't know.   I also sensed a patronizing tone throughout.  I get the impression by reading it that he wrote this first as an outline for some high school sociology class, and then tried to expand it to something that the great \"unwashed masses\" would take as a serious, scholarly work.  Well, I'm sure that even the \"masses\" aren't that easily impressed.\n\nSo I do not recommend wasting your time on this one!Read full review",
            "Malcolm Gladwell's Tipping Point considers the elements needed to make a particular movement gain mass appeal.  The title concept, \"tipping point,\" occurs when something that began small- a few funky kids in New York's East Village wearing Hush Puppies- turns into something very large- millions of Hush\nPuppies are sold.  According to the author, the success of advancing any idea depends on three rules: the Law of the Few, the Stickiness Factor, and the Power of Context.\n\nGladwell offers a theory of social dynamics that he contends will provoke a mass behavioral change.  He offers numerous anecdotes to make his point: Paul Revere's ride, the creation of the children's TV program Sesame Street, and the influence of subway shooter Bernie Goetz.  After analyzing a number of fascinating psychological studies, he propses that tipping points occur when subtle alterations in the environment, such as the eradication of graffiti, are enacted by a small number of people who act as connectors, mavens, and salesmen.  As he applies his strikingly counter-intuitive hypotheses to everything from the \"stickiness,\" or popularity, of certain children's television programs to the spread of sexually transmitted diseases, Gladwell reveals that our cherished belief in the autonomy of the self is based, in\ngreat part, on wishful thinking.\n\nTipping Point has the feel of a cut-and-paste narrative- which is probably attributable to Gladwell's journalistic background- and is definitely not the stuff of deep academic research, or sociological thought.  It is, however, an entertaining read that I would HIGHLY RECOMMEND and should affirm what we already knew, if we were honest with ourselves.Read full review",
            "Have read all three of Malcolm Gladwell's books.  Each title has a totally surprising approach to what causes things in life to change.  I found that the content of this book dealt with how things in life can change. After extended changes occur an unexpected crescendo may cause a tipping point that may make directional changes necessary.  Often we can see it coming but may be surprised just how little influence we have to the tipping point. Lots of fun and a quick read.  Good trip on the plane.",
            "This is an important book to read if you want to know how crazy the buyers can be and how a person needs to be tuned into the unpredictable factors that can push your product or idea to the forefront and cause it to spread virally.  It helps me realize that I must always prepare for the best possible outcome with any of my projects even if they start slowyly--to always being getting the ideas in front of people so that the \"right\" person doesn't miss the chance to help you share BIG with the world.\nThis book lends another perspective for anyone wanting to have a well-rounded foundation in what's happening and what can happen in the whimsical global market.",
            "This is an excellent example of in-depth journalism.  Some books are fast food: fun to read, but not really nourishing.  Some are like those horse pill multi-vitamins:  spilling over with everything your body needs, but really hard to swallow.  This book is one of the best literary meals I have had in quite awhile!  It is delicious!  It is easy to read, very insightful, loaded with information, and thought provoking.  For me, it is the kind of book that I could read pleasurably over a few weeks time.  I didn't need to inhale it.  I wanted to assimilate the commentary slowly.  I enjoyed it so much that I bought a copy for one of my sisters for her birthday.  I will enjoy discussing it with her as she nibbles her way through it.\n\nIf you love to read and you're interested in the elements of events that cause them to tip one way or another, you'll find this book fascinating.  The author is an excellent writer.  If you've ever read his blogs or his work for the New Yorker then you probably appreciate his style.  I'd also recommend BLINK, his subsequent work.  I look forward to more books from this young, talented author.Read full review"
        ],
        "Rating": "2"
    },
    {
        "Title": "Friends, Lovers, and the Big Terrible Thing: A Memoir - Hardcover - GOOD",
        "Price": "$8.44",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Mr. Perry did every US family a great service with this candid glimpse into his life as an addict fighting to get the bear off of his back. Heartbreaking that he died before realizing how important sharing his story is to so many.",
            "I could not put this book down.  It amazes me that his acting was as good as it was considering his addiction. His story reminds me that you never know what is going on behind closed doors.",
            "Great book.  Honest read, compelling, quite a page turner.  Funny, sad, real.",
            "After reading, this book will be on a shelf in my library.    Such a loss.",
            "Such a good book, kind of hard to put down.  When reading i sometimes read it in chandlers voice.   So glad that Matthew wrote a book on his life and about friends"
        ],
        "Rating": "5"
    },
    {
        "Title": "Influence : The Psychology of Persuasion by PhD Robert B. Cialdini (yellow)",
        "Price": "$14.80",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Facing Codependence: What It Is, Where It Comes from, How It Sabotages Ou - GOOD",
        "Price": "$3.93",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This book is easy to read and understand.  It makes the subject of Codependency understandable.  I especially like that the author explains each concept and then follows up with examples.  I would recommend this book for almost everyone and especially for parents of young children.",
            "A bunch of my friends from a 12 Step fellowship and I have been using this book (and Breaking Free, also by Pia Mellody) for a book study group we started a couple of months ago. We read designated chapters from the book and journal as our homework, then we meet every two weeks and share our experience, strength and hope with each other. It's been really great so far and we have all grown from doing this. While I don't agree with all the concepts in this book (for example, I don't believe that seeing our parents in their underwear is sexual abuse, or that without boundaries people will DIE - Mellody is pretty severe in her judgments in my opinion) some of the readings have been really eye opening.\n\nDon't read this book if you are not currently seeing a therapist regularly and without discussing it first with your therapist. Some of the concepts as I said are very extreme, judgmental and severe, and without proper guidance and support, can really mess with someone's mind and propel them further into shame or self-deprecation. It would be helpful to do some formal therapy first.Read full review",
            "Incredible enlightening book that touches on so many things in a small easy read that it is unimaginable. If you're the child of an alcoholic or have been neglected and not sufficiently embraced in your early life this is a must-read",
            "Helpful for understanding relationships and how people in your life shape your experience of emotions and your expression. Examples of nurturing family relationships are given as well as examples of toxic relationships. The cover picture is interesting, it is a corner room with two windows but there is only a shadow facing one direction, symbolizing point of view can be influenced.",
            "Book is in good condition, and readable.  It has pages that are highlighted, and overall I got a good deal for it."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Wisdom Wheel : A Mythic Journey Through the Four Directions by Alberto...",
        "Price": "$9.00",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Combo Set of 3 Books ( Psychology of Money+ Rich Dad Poor Dad+ Atomic Habits) PB",
        "Price": "$23.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Life Expectancy: A Novel - Hardcover By Dean Koontz - GOOD",
        "Price": "$3.86",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I love to read anything by Dean Koontz, so I immediately jumped at the chance to buy a book of his that I had not read. Dean Koontz is known for his books on human existence; love, hope and good against evil. This one is somewhat different from his others in that you know something bad is going to happen to the main character, Jimmy Tock, on 5 named days in his future. His grandfather made these predictions on his deathbed and as the novel progress you see that the predictions are coming true. There are several unexpected twists throughout the plot. It is both suspenseful and funny. I haven't read a book by Dean Koontz that I did not like.",
            "I am really not a reader.  I do not usually pick up a book and just start to read it, but it happened with this book.  People I work with were all talking about it.  I thought it was going to be another book you get half way through and put down.  I read the whole thing in about a week and, in most cases, could not put it down.  Very well written and you never quite know what is going to happen next.  It got me reading more Dean Koontz books and the list is getting longer of the books to read next.",
            "I bought this book after reading a draft of it at the end of Koontz's book Odd Thomas. Dean Koontz has done it again, has created a character that you can fall in love with and root for. Written with the same humor as his Odd Thomas series, Jimmy Tock and his family must wrestle with the predictions of his Grandfather, 5 terrible predictions made on the night of Jimmy's birth, as his Grandfather dies. The love of family, of sacrifices and choices made to insure the future of the family, is a delightful and sometimes heart-wrenching story that everyone should read.",
            "Read this book years ago but it was still good reading it again.",
            "As an avid fan of all of Dean Koontz's work, I am always excited to see a new book of his on the store shelves. Life Expectancy is another example of why I keep reading everything this author puts out.\n\nGreat characters and a gripping story keep you wanting to turn to the next page and read just one more chapter. My only problem with the book is how fast I finished it.\n\nBut thats ok, I can always read another...."
        ],
        "Rating": "5"
    },
    {
        "Title": "Power vs. Force - Paperback By David R. Hawkins - GOOD",
        "Price": "$4.44",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "While and easy read, this book contains an incredible scientific study of the subtle energy we live in and is part of us. Anyone who practices Ki Society Aikido, Tai Chi, or Chi Gong will appreciate this  work. I highly recommend this also to anyone working for social change. While I know Scientism and New Atheism has attacked this work and it's author, they cannot refute the findings. \n\nI highly recommend this book.",
            "I purchased this book after reading the forward of it in my chiropractors office. The forward has a nice, concise explanation including some examples of what Applied Kinesiology (AK) muscle testing is and how it works. I bought the book thinking it was going to be a basic \"how-to\", sort of a users guide for AK. Well, while it does do some of that, it goes much, much deeper. The author has advanced degrees in both medicine and psychology. He obviously knows his stuff. But what was surprising to me is that the experiences in his life he shares, along with his intellectual and spiritual revalations are to say the least - enlightened. The spiritual connotation in the book is non-denominational. While Dr. Hawkins came from a Christian background, his understanding of God has transcended the four walls of the church itself. That part of the book may create some cognitive dissonance in the puritanical Christian reader. But please, don't let it stop you from reading on. This book should be pleasing for anyone seeking a higher understanding of consciousness or spirituality. If you are interested in how consciousness affects and controls our lives on the micro and macro levels, from personality to politics, this book is an excellent resource. I would highly recommend it to anyone with an open mind.Read full review",
            "This book will have you reevaluating your life decisions. It goes in depth about the limits of humanity and how to overcome them. A dauting task in itself.What I really got out of it there are alot of unknow forces at play in life and looking at life from this angle will help you answers some of the great unknowns about life.",
            "Too easy to see after reading this that Power is Common Sense and the current Trump administration is all Force.\nHistory proves time and time again that the Dark side will not prevail.\n\nI recommend everyone to read and heed for whichever level in life they are at.",
            "I have been on a spiritual  \"journey\" for about 8 years.  I read this book before, then read several others of his books, and I loaned this one out.  I wanted to read it again - it's that kind of book (each time you read it, you get more out of it).  So I bought another copy.\nParts of this writing seem highly scientific, with vocabulary that is not in most people's everyday use.  But stick with it.  The message Dr. Hawkins has is so important to spiritual growth and understanding.  His use of kinesiology is amazing.  It's easy to prove to yourself.\nThis answers so many questions and at the same time leaves you hungry for more information from this brilliant, spiritually evolved man.  It's my understanding that he's giving his last seminar this year, and there may not be any more \"Hawkins Books.\"  My advice, if you are on a spiritual journey, is to read all you can by him - especially this book, The Eye of the I, Truth vs Falsehood, and Transcending the Levels of Consiousness.  You may find you want to loan out your copies - and then want to refer back. I've already loaned out this copy.  Next time, I'll get 2.\nFabulous.Read full review"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Gift of Fear and Other Survival Signals that Protect Us From Violence - GOOD",
        "Price": "$5.97",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This is such an interesting book. I read it very quickly. Lots of helpful information.",
            "What was advertised was the 1999 copy however I was sent the 1997 version. The current version cover is white, blue with a red  stripe. The 1997 version is silver, blue with yellow stripe.",
            "In Matthew 10:16 in the Bible, God says, \"I am sending you out like sheep among wolves. Therefore be as shrewd as snakes and as innocent as doves.\"  This book provides the wisdom necessary to discern who is trustworthy and who might be seeking a person's demise.  I highly recommend it.",
            "I bought this book because I occasionally work with victims of domestic abuse, and this book was regularly recommended by the local Safe House staff.  It is an eye opening book with disturbing but valuable insight.  The author uses numerous real life stories to demonstrate that our instincts regularly give us accurate warning when we are around dangerous people, and that we ignore our instincts at our peril. I'd like my daughter to read this book before she goes off to college.",
            "Very good read !! Everyone should have a copy of this book it could save your life !"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Trial - Paperback By Kafka, Franz - GOOD",
        "Price": "$5.12",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I only read limited fiction.  Kafka is my favourite.  \"The Trial\" is amazing.  I've read it four times.  If you are into Kafka, this is my personal favourite novel.  Dearest Father is an excellent read as well if you have ever dealt with a narcissist.  Read beyond \"Metamorphosis,\" please.",
            "Book is in great shape, thank you!",
            "Great read",
            "good cheddar."
        ],
        "Rating": "5"
    },
    {
        "Title": "The 4 Disciplines of Execution: Achieving Your Wildly Important Goals - GOOD",
        "Price": "$4.01",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Awesome"
        ],
        "Rating": "5"
    },
    {
        "Title": "Crucial Conversations: Tools for Talking When Stakes are High, Third Edition",
        "Price": "$8.95",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "This is very practical in all business interactions today"
        ],
        "Rating": "5"
    },
    {
        "Title": "Kindred - Paperback By Octavia E. Butler - GOOD",
        "Price": "$5.97",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This time travel back to the past with brief returns to the present is a unique way to expose the ugliness of black slavery in the antebellum South. It is a compelling story but occasionally gets a bit bogged down in repetition. I will add that I am a Senior white southerner but still found this book to be a good read. I saw it listed on ABE Books recommended 100 books to read and had not heard of it so ordered it. It has been out about 25 years.",
            "Great book by a great author of science fiction.",
            "I love all of Octavia butler books. If it's your genre....you'll love it.",
            "Slavery was evil. But I “went back” to that time and felt the fear and pain of it almost  physically. Felt like I knew these people!",
            "This is a neat book with a cool idea.  A young woman is pulled backwards in time to the antebellum south by her distant relative.  There are some big holes in the plot, but it is still a really good read."
        ],
        "Rating": "4"
    },
    {
        "Title": "The 7 Habits of Highly Effective People: Powerful Lessons in Pe - ACCEPTABLE",
        "Price": "$3.97",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "We have already gifted it to 2 of our  grown children. This is a keeper. Not for loaning out. Barely half done so far. Will read it again to take notes and absorb the content more fully. \n\nUnlike some other books, this is applicable even though my husband and I have been seniors a long time. It applies to all aspects of our lives. Not just acquiring material wealth.",
            "I am having an excellent experience with this book, it is doing me change many concepts about life. The author teachs us about several ways to make us happy in life, how we can positively contribute, specially to us, and to different persons, be of the family or be to unknown persons, at home, at company, at school, at restaurant, whatever and wherever be. Stephen teachs us that we should not let the situation dominates us, unlike, we are us to dominate the situation and give it the better response, the response that will do not sick us of the soul and body.\n\nFor more information and learning, read this book, I have sure every that read it will like and get a new vision about the life and will pass to live better, far better. Provided that what is learned is applied.",
            "I have red the book which helped me a lot in my practical field  in a way how draw a map and focus on the end. As if your are their. It guided me with many ideas as a manger when dealing with the situations. As well as applicable to my work.this book is value for money. I really recommend to buy it.  And I purchased two books as. Gift to my sons.",
            "As a mother, wife, and coach, I have found that I need to be continually stretching myself and growing as a person in order to fulfill each of my roles most effectively. Although I am a natural leader, there are many areas of opportunity for me to address in order to reach my full potential. \r\nStephen R. Covey's \"7 Habits Of Highly Effective People\" is an excellent book to bring clarity into your life. Should you need tools to help create purpose, goals, and vision, this book is for you. Covey clearly communicates each habit using a variety of diagrams and charts, concluding each habit with a series of application suggestions. Take your first step toward taking over the reins of your life by reading and applying the principles of this book... you will not be disappointed.",
            "The company was extremely responsive and timely, friendly to work with. This will be my new go-to Place for quality copies of used books."
        ],
        "Rating": "5"
    },
    {
        "Title": "Sports Psychology - A Complete Introduction Perry, John Very Good",
        "Price": "$8.11",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Explosive Child: A New Approach for Understanding and Parenting Easil - GOOD",
        "Price": "$3.80",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "If you have the energy to put forth great parenting this book is a great read.  It's a neat approach to solving problems your kids have.",
            "As a therapist i found this book to be a real eye opener! i have a hard time reading books with info, But this book was amazing and interesting to read!! very very informative!!"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Light Eaters: How the Unseen World of Plant Intelligence... by '\"Zoë Schlang",
        "Price": "$10.55",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Psychology in Everyday Life Paperback David G., DeWall, C. Nathan",
        "Price": "$10.50",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Ready for pysc 101!!!"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Happiness Trap: How to Stop Struggling and Start Living: A Guide - GOOD",
        "Price": "$4.63",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Very impressed with the content of this book. I’m a therapist and it brings great material to sessions and groups.",
            "It’s well written and has content that would benefit anyone.",
            "Great!!!  Good read",
            "Interesting and helpful book."
        ],
        "Rating": "5"
    },
    {
        "Title": "Liar: A gripping psychological thriller with a shocking twist - VERY GOOD",
        "Price": "$5.06",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I loved this book, worth reading!"
        ],
        "Rating": "5"
    },
    {
        "Title": "Stoner (New York Review Books Classics) - Paperback By John Williams - GOOD",
        "Price": "$12.21",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I actually thought this book would be alright but I was delighted to find that it was much better.  I actually plowed through it in less than a week.  Very well written, entertaining book.",
            "Why didn't I know about this book before? It is brilliant, poignant and beautifully written. A life most ordinarily lived, but with a tragic grace.",
            "arrived in great condition. Story was compelling.",
            "This is my grandpa John Williams and am very proud of him .",
            "Not much more to say I guess. It was the book I ordered."
        ],
        "Rating": "5"
    },
    {
        "Title": "Dark Psychology 6 Books in 1 By Benedict Coleman (English) Paperback, New",
        "Price": "$7.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "How Successful People Think: Change Your Thinking, Change Your Life - GOOD",
        "Price": "$3.98",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This book really opens up the universe of creative thinking in the pursuit of building wealth. I found it much more useful and applicable than “Think & Grow Rich”.",
            "This is a great book. High up your motivation. a must read. I would recommend this book to my friends.",
            "This is one of the best book, written with good wording and best quotations. I really appreciate the writer for this effort.",
            "100% brand new book!! Couldn’t have expected better. Thank you!",
            "You always learn something when John C. Maxwell opens his mouth. He is able to keep you interested. You don't want to put the book down."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Psychology of Selling: Increase Your Sales Faster and Easier Than You - GOOD",
        "Price": "$9.84",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "What a great book on selling. If you're new or if you've been selling for years this book has content that will benefit you. It's amazing how many topics this book covers.  It is full of simple and direct information that will benefit any sales professional if you want to increase your dollar amount that you're worth this book is worth reading.  In fact it's worth reading twice",
            "Absolutely excellent book.",
            "Great book for anyone in sales",
            "Right on time before class",
            "It is a great buy. Everything is great about it."
        ],
        "Rating": "5"
    },
    {
        "Title": "The Inmate - Paperback, by McFadden Freida - Very Good",
        "Price": "$8.23",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I really liked this book.  It was hard to put down. I thought I had it all figured out but was very surprised at the ending. You won’t regret reading this one!"
        ],
        "Rating": "5"
    },
    {
        "Title": "All Your Perfects: A Novel - Paperback By Hoover, Colleen - GOOD",
        "Price": "$4.93",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Colleen Hoover is a great writer.  Her books pull you in and keep you interested.  I don’t want to stop reading.  You will not be disappointed.",
            "This book was bought as a gift, I did not read it",
            "I really enjoyed this book",
            "everything was great",
            "Im satisfied I bought this book."
        ],
        "Rating": "5"
    },
    {
        "Title": "Who Moved My Cheese?: An Amazing Way to Deal with Change in Your Work and - GOOD",
        "Price": "$3.78",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Most instructors make a syllabus available at least 3 weeks before a semester starts. For whatever reason my instructor uploaded the wrong syllabus, the first day of class we spent more time re-writing her corrections. It was at that time that the whole class discovered that we had a quiz on 2 chapters in 1 week (even the ISBN # was wrong). Needless to say, I know I was not the only feeling pressure when we left class. \n\n\n    My instructor suggested this book, I came home and found this GREAT DEAL and a delivery date that fit my needs, with a day or so left over to have sometime off after writing a 10pg book report on it, according to the delivery options. Well, beyond my expectations, the book arrived today !!!! Not only is this a surprise, it is a relief and I get an additional fewdays off, for a total of 5 days. I mean what college student would pass that up ??? I am going to email all my classmates and let them know, how efficient you are. \n\n     This is amazing, honestly !!! Thank you bunches !!!!Read full review",
            "This is a second time I have read this book.  The content is all there but the presentation is drab compared to the original book.\n\nThe discussion and story about the how it came about and then the views of the peanut gallery in at  end of the book were not part of the original book I remembered.  It is all interesting but the story is what I was mostly interested in to share with another person who has had several times her cheese has been moved.  I hope she will get the point of the book.\n\n\nThe cover is drab, the pictures are too even though they are the correct pictures\n\nPresentation is what begins the sell of many  things.  How the book looks at first glance is for some a deciding factor to purchase an item..",
            "I had heard a lot about this book. Never ever got to read it. Recently I got hold of one copy from HR in our company. I read it on a plane journey. The concept is pretty simple but what is important is author has tried to spell it out in a very interesting fashion. Author uses mice respresenting simple straight thinking and mice like people representing complex thinking. Author's idea of 'Keeping things simple in order to make our lives much comfortable' is so very true. Beginning of the book is nice and intriguing. I wouldn't be surprised if the reader gets bored in the middle of the book. Some times author is trying to emphasize a point over and over again. This can be really boring for some people. Nevertheless the objective of empasis seems to be justified as you reach the end of the book. Overall it was interesting light reading with some inspiration and new outlook towards looking at things in life. Its a really small book, if you like reading somethign light, its worth reading once. I surely say that the central idea may or may not apply for individual's situation.Read full review",
            "The books start with a group of friend meeting up after their high school reunion, and on of the friends start telling a story, Who moved my cheese??? It is a story about two little mise and two little man looking for a cheese in a maze .The cheese in the story is a symbol for everything we treasure in life ... The cheese can be our job,our relationship,or everything else thats important to us ,When the cheese in the book runs out each and every character deals differently with the situation ,\nAs you continue reading the book you will find yourself relating to the character and notice the way you react to the changes that occurs in your life The fear of unknown, the fear of failed and how we let fear control our life, and that sometime we rather stay in our comfort zone instead of dealingwith the changes.\n\nThis book is about how we adapt the changes in our life.\nand how we can create new possibilities when the change accurs.\nWho moved my cheese??is a great book for dealing with everyday changes.\nThe story teach us how to imburse the change ,and it how to let go of old ideas and habits and embracing new ones.Read full review",
            "This parable featuring two mice named Sniff and Scurry and two people named Hem and Haw attempts to address the subject of change and characterize the pros and cons of different approaches to change.  Sound simple ?  It is.  This could be a kid’s book written in 15 point font and still not make 15 pages.  How and why the author managed to generate enough verbiage to fill an entire book, let alone make a fortune as a bestseller, is beyond me.  Seriously, this is kindergarten 101 stuff.  Things change.  You can react or not react.  You can react slowly or quickly.  You can be flexible or inflexible.  You can embrace change or fear and avoid change.  Are you bored reading this review ?  Think how bored you will be reading the book.\r\n\r\nWhy would you ever buy this book ?  There are plane ridesthat are too short to get really drunk on.  There are conversations with your mother-in-law that could potentially be avoided.  Maybe youre actually dealing with a major change in your life, aren’t sure how to deal with it, and need a framework to think about your options.  These are all good reasons to buy the book and given the money ($5) and time (1h 25m) you’ll need to invest to read the book, it seems like a small price to pay.  My big take away from this book is that I need to change professions and become a self-help writer recycling childhood life lessons in the form of parables that sit in the business section of the bookstore.Read full review"
        ],
        "Rating": "5"
    },
    {
        "Title": "Psychology for Dummies by Adam Cash (2020, Trade Paperback) 2c",
        "Price": "$14.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "People of the Lie: The Hope for Healing Human Evil - Paperback - GOOD",
        "Price": "$4.18",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Very enlightening content\nI chose to give this book a high rating because I agree with the spiritual side of the authors ideas, to a point. He could have left out the chapters on exorcism and it would be in my top 10 of all time. Not because of the conclusions he offers concerning the exorcisms, but because of his ideas about who should be present in future exorcisms. 🤔🤔",
            "A very readable book.  The author cuts through textbook psychological disorders and gets to the underlying root of the most painful human conditions.  Peck is an MD who gives power to his assessment of human evil.  Don't let the aspect of religion deter you from reading this book.  It is medically based.  If the Christianity piece of it bothers you, skip the 1st chapter and perhaps the ending chapters on exhorcism.  What's in between is solid psychiatric writing that addresses mental health issues from a new point of view.  This reader found the arguement compelling, the reading fluid and the case studies interesting.  Not a heavy read, but a meaty concept.",
            "This is an interesting book explaining a perspective on what is wrong about certain aspects of human society and the inability or refusal of some people to take accountability for their actions.  The author at times comes across as a holier than thou \"Psychiatrist\" expert, but he highlights his experience with individuals who are intent on hiding their actions and blaming the world for their problems.  As a therapist who has worked with such individuals I believe Dr. Peck has some correct ideas about what is wrong with aspects of society that perpetuate the escaping of individual responsibility and personal accountability.  This book is an interesting read.",
            "This book by M. Scott Peck is just as insightful as his classic, \"The Road Less Traveled\". A must for theologians and those who work with prisoners, abusers, thieves, and other miscreants.",
            "Dr. Peck's perception of evil is thought provocing. His theories are interesting and the patients he profiles hold your interest . If you are the least bit interested in psychology, psychiatric practice or mental illness versus possession, this book will hold your interest."
        ],
        "Rating": "5"
    },
    {
        "Title": "No More Mr Nice Guy : A Proven Plan for Getting What You Want in Love, Sex, and",
        "Price": "$13.99",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Reading the book felt like a look in the mirror. Now things make sense. Frustrated no more!\n\nIf you have spent your life \"being nice\" and not getting the results in your relationships and career; read this book. It will open your eyes to \"why\", and when you finally know why, you can make a choice to change it for the better.\n\nAuthor does a great job explaining why nice guys became that way, then offers suggestions on how to change for the better. Highly recommended!",
            "I have read the first two chapters & so far this book nails down some things I have been wondering about and describes some of my observations to a T! I understand I will be uncomfortable a little farther along cause it takes\" two to tango\" in a dysfunctional relationship, but we've been told that \"The truth will set you free\" so I recommend this book with one disclaimer: there is much that is helpful in the book, however if you are of a Christian persuasion you will have to overlook some of the practical advise!",
            "There are a lot of fantastic books out there but this one tops them all! This book teaches you to truly be okay with being yourself. It works! It's geared towards men, however,  I recommend both males and females to read the book. It most definitely will change your life!",
            "I like the book it has opened my eyes to what I have been doing most of my life I wish I would have read this book sooner",
            "Interesting book--since the 60's men have been trained to be sensitive, which is not a bad thing, but the strength inherent in men has come to be viewed as a bad thing.  Men have become weak>>then not respected.  The only ones still trying to be \"manly\" are the idiots & gangsters, & many women fall for them, confusing cockiness & bullying for real strength.  I don't agree with everything in this book, but sometimes suggest it to my male clients, who need to be a bit stronger in their relationship."
        ],
        "Rating": "5"
    },
    {
        "Title": "Night Road: A Novel - Paperback By Hannah, Kristin - GOOD",
        "Price": "$6.74",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The Artist's Way: A Spiritual Path to Higher Creativity - Paperback - GOOD",
        "Price": "$4.66",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "I in the mist eadung & working  within the book that as assignments  \nMostcmught be put off for the mention of puppet master l refere to  Ever since years ago in a tv sit come one said it l like it it stuck .I when write mention the heav ed ns above so if not just on converting one into believing confirming ti way others need to belive l belive in my way it works for me& comfy with that topic l okay with it helping me get to a goal l need to be at. Book is fine condition 👍😷😇🕊",
            "This is a great book for any writer or ANYONE looking to get back in touch with his/her creative side.  The book addresses some of the psychology behind being creatively \"stuck,\" why we avoid using our creative talents, and why creativity should be a priority. The exercises are useful and relevant. I particularly enjoyed the discussion of cleaning out the house--metaphorically and literally ridding ourselves of those things we no longer need.\n\nIf you have a hard time interpreting the word \"God\" to suit your personal belief system, you might have difficulty with this book.  While the book is not doctrine specific, many discussions do focus on the spirituality of creativity.\n\nI bought this book after I joined a meet-up group designed to go through the various chapters and discuss how the material might be relevant to our personal creative lives.  It's been an excellent source of discussion for those of us interested in creative process.Read full review",
            "I like the spiritual journey into letting your creative artistry flow. I like how the book is setup with comprehensive lessons, tasks, and check ins at the end of each chapter. The author shares very interesting and comprehensive ways to exploring our creative energies.",
            "I was enthusiastic about this book during my first reading of it; some of the concepts presented in the book really resonated with me. The author recommends daily journaling, which is something I do anyway. Also, the idea of “artists dates” appealed to me. \r\n\r\nUpon re-reading the book I have changed my favorable opinion of it. I now realize that there are many harmful things that I initially overlooked.\r\n\r\nThe first thing that I think is harmful: It seems to me that Cameron advises artists to pretty much squash their “inner critic” flat. While this might be a good idea for an artist who is so blocked that (s)he can’t produce any work at all, I think it is dangerous advice for a working artist who is already successfully creating. Personally, I know that the drive to satisfy my “inner critic” is part of what makes my art good.  My inner critic is a real slave-driver, and she has high standards. As tempting as it would be to just make her go away, that would have a negative effect in the outcome of the quality of my art. In the long run I think it is more productive to learn to nurture your inner critic and satisfy her demands than it is to trample her.\r\n\r\nAnother harmful thing about “The Artist’s Way”: My impression after reading this book is that the author presumes to speak for God, and that she presents her own opinions as facts in this area. She seems to be of the opinion that spirituality and creativity are inextricably linked. I disagree, considering that I know some highly creative atheists who are successful artists. Many of the premises in this book are just plain flawed.\r\n\r\nThis book is as much about religious indoctrination as it is about creativity. I know people who have mistaken this book for a Christian book because of all the references to God that are made in it. It is definitely NOT a Christian book. It is a new age book. I would not recommend this book to anyone who doesn’t already embrace a new-age viewpoint. There are many things about the religious concepts in this book that you might find disagreeable if you don't agree with New Age philosophy. I definitely wouldn’t recommend it to Christians, nor would I recommend it to atheists or agnostics. (Truthfully I wouldn’t recommend it to anyone.) If you do read the book, please stay alert to the places in which the author presents her religious beliefs and opinions as fact.\r\n\r\nThis book has an eerie amount in common with the 12-step programs popularized by Alcoholics Anonymous and Narcotics Anonymous. There are exactly 12 chapters in this book; each of them incorporates the concept of “Recovery” in some way:\r\n\r\nWeek 1: Recovering a Sense of Safety \r\nWeek 2: Recovering a Sense of Identity \r\nWeek 3: Recovering a Sense of Power \r\nWeek 4: Recovering a Sense of Integrity \r\nWeek 5: Recovering a Sense of Possibility \r\nWeek 6: Recovering a Sense of Abundance \r\nWeek 7: Recovering a Sense of Connection \r\nWeek 8: Recovering a Sense of Strength \r\nWeek 9: Recovering a Sense of Compassion \r\nWeek 10: Recovering a Sense of Self-Protection \r\nWeek 11: Recovering a Sense of Autonomy \r\nWeek 12: Recovering a Sense of Faith \r\n\r\nI don’t know about you, but I don’t need to recover any of these things. I think it’s presumptuous of the author to assume we’ve all lost our senses of compassion, integrity, strength, faith(etc.)\r\n\r\nIn all fairness, the book is interesting to read & some of the exercises in it are quite creative. Overall, though, I think that this book is a waste of time.Read full review",
            "If you have hit a wall with a creative project - or life in general - try this book. Even if you don't do every single exercise every day, it will make you think about your process and I've noticed that ideas and memories surface unannounced. You don't need to be a deity-believer - just take what works for you and ignore the rest. Interestingly, I'm finding that I'm a lot less smirky under my mask about the god-references in the book. The phrase \"random universe\" works well as a replacement if you need one. If you can do it with someone else I'd recommend it. Much like 12-step programs, doing it with another person keeps you committed."
        ],
        "Rating": "4"
    },
    {
        "Title": "Games People Play: The Psychology of Human Relationships by Eric Berne paperback",
        "Price": "$10.48",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Verity - Paperback By Hoover, Colleen - GOOD",
        "Price": "$5.31",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Colleen Hoover develops this story creating a book within a book.  I loved how she wrote this story from both the antagonist and the heroin's perspective.  I didn't want to put this book down.  Read within 2 days.  I can't wait to get my next CH books.",
            "I definitely would not consider this book in “good” condition. Very worn on the cover. As if it had already been passed around between a number of other readers. \nHowever, the book itself is a great read. I had a hard time putting it down and finished it within 3 days.",
            "Book was not in good shape. Maybe acceptable at best. And at least put some bubble wrap around the books to protect them in the polymailer.",
            "For a quick read like this (short, but I also couldn't put it down), I am not worried so much about the quality of the book. The paperback cover had some slight but visible wear, but overall the pages were in tact and barely had signs of wear. I highly recommend this book, but also the seller!",
            "Mystery/suspense - not my usual style but really enjoyed it!  This author can write!"
        ],
        "Rating": "5"
    },
    {
        "Title": "The Searcher: A Novel - Paperback By French, Tana - GOOD",
        "Price": "$5.64",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "The Searcher is a compelling story set in Ireland's countryside.  Tana French excels in creating characters about whom her readers can begin to care almost too much.  And, of course, her lyrical prose is a delight to read.  I highly recommend this book.",
            "Great purchase!",
            "Great book!"
        ],
        "Rating": "5"
    },
    {
        "Title": "I Thought It Was Just Me (but it isn't): Making the Journey from What Wi - GOOD",
        "Price": "$4.30",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "This book changed me! I loved it and subsequently read the rest of her books right away. I had first checked it out at the library but then realized I needed my own copy. I have bought this for about 7 other friends who needed to hear how shame changes us and how we can heal from it.",
            "Very deep and meaningful well done can change the way I feel about things that were difficult in my life glad I bought it.",
            "This books is spot on in helping me with self-confidence!",
            "Great information and very helpful",
            "Good book. Helpful identifying guilt and embarrassment from shame for anything in your life.  Helpful self-help book."
        ],
        "Rating": "5"
    },
    {
        "Title": "One Flew Over the Cuckoo's Nest - Mass Market Paperback By Kesey, Ken - GOOD",
        "Price": "$4.24",
        "Author": null,
        "Top-Rated Seller": "Yes",
        "Reviews": [
            "Didn't expect how it was written but It was a good read. Not the same edition as in picture.",
            "Better than the film. I read it all without stopping! Thoughts and actions advance the story without need for long  of description.",
            "The book is clean, no torn pages.",
            "It is not a pleasant book to read. Not something I enjoy. Didn’t finish it. Put it in my recycle box.",
            "Right on time. A classic. Can't wait to read it."
        ],
        "Rating": "5"
    },
    {
        "Title": "Love Life by Matthew Hussey NEW Paperback",
        "Price": "$16.85",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "The SILVA MIND CONTROL Paperback by by Silva Jose (Author), Miele Philip",
        "Price": "$9.90",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "This book is very insightful and interesting. I read it completely and I am now on my second read, which is what the author says to do in order to implement the techniques taught by Jose Silva.",
            "This is a fantastic book for those who want to improve their lives in a mild spiritual way.  It certainly changed my life for the better after reading it once and then rereading it to practice the meditations that it has to offer. I highly recommend this book, if you feel stuck, just want to advance in your life, or for whatever reason. I definitely recommend this book! It’s a quick read and very simple to practice and understand.",
            "Since This book was published I have purchased and gifted a copy to my friends and family in need of self help. It has helped them as well as me and strongly encourage others to read this book.  I have purchased roughly 10 books in total and it has been a great experience reading this book",
            "interesting. reintroducing myself to things and thinking I learned as a child but has faded into the past.",
            "I needed a replacement for the same book that was lost many years earlier and this fit the bill.  Even a better read than I remember."
        ],
        "Rating": "5"
    },
    {
        "Title": "📚 The Psychology of Money : Timeless Lessons By Morgan Housel NEW Paperback",
        "Price": "$9.29",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": [
            "Doesn’t matter where we are on in our money game… we can always invest, so we can start by deciding or choosing to Today!",
            "The content is very compelling. It's a shame parts of it are almost unreadable for lack of proofreading.",
            "Great book - highlighted. probably 1/4 of it.  read it.",
            "Good insight into personnel finance on managing money",
            "A great book that everyone should read."
        ],
        "Rating": "5"
    },
    {
        "Title": "Becoming Supernatural by Dr Joe Dispenza & The Psychology of Money Set of 2 book",
        "Price": "$21.95",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    },
    {
        "Title": "Morgan Housel 2 Books Set The Psychology Of Money & Same As Ever",
        "Price": "$17.49",
        "Author": null,
        "Top-Rated Seller": "No",
        "Reviews": null,
        "Rating": null
    }
]